{
  "lastUpdated": "2026-02-02T13:01:17.471Z",
  "articles": [
    {
      "title": "Retirement: \"Send data to Event Hubs & Storage (Preview)\" retiring July 31, 2026",
      "link": "https://azure.microsoft.com/updates?id=551523",
      "description": "On July 31, 2026, we'll\r\nretire preview feature “Send virtual machine client data to Event Hubs and\r\nStorage (Preview)” and it will no longer be supported by Microsoft. You will not\r\nbe able to create any new data collection rules using this feature, and any",
      "japaneseTitle": "廃止: 「イベント ハブとストレージへのデータ送信 (プレビュー)」が 2026 年 7 月 31 日に廃止",
      "japaneseDescription": "2026 年 7 月 31 日をもって、プレビュー機能「仮想マシン クライアント データをイベント ハブとストレージ (プレビュー) に送信」が廃止され、Microsoft によるサポートが終了します。この機能を使用した新しいデータ収集ルールの作成はできなくなります。代替手段として Azure Monitor エージェントを使用することをお勧めします。主要リージョンでは、Azure Monitor エージェントの使用が推奨されています。",
      "technicalTags": [
        "Event Hubs",
        "Azure Storage",
        "Azure Monitor Agent"
      ],
      "extractedLinks": [],
      "date": "2026-01-30T18:30:02.000Z"
    },
    {
      "title": "Retirement: Support for Python 3.10 ends on October 1, 2026 – upgrade your Azure Functions apps to Python 3.13",
      "link": "https://azure.microsoft.com/updates?id=545771",
      "description": "In alignment with the end of community support, on October 1, 2026, support for Python 3.10 in Azure Functions will end. Your\r\napps that are hosted on Functions will continue to run, but security updates\r\nand performance optimizations will no longer be avai",
      "japaneseTitle": "廃止: Python 3.10 のサポートは 2026 年 10 月 1 日に終了 – Azure Functions アプリを Python 3.13 にアップグレード",
      "japaneseDescription": "コミュニティのサポート終了に伴い、2026 年 10 月 1 日に Azure Functions での Python 3.10 のサポートが終了します。Functions でホストされているアプリは引き続き実行されますが、セキュリティ更新とパフォーマンスの最適化は受けられなくなります。Python 3.13 へのアップグレードを検討してください。",
      "technicalTags": [
        "Python 3.10",
        "Python 3.13",
        "Azure Functions"
      ],
      "extractedLinks": [],
      "date": "2026-01-28T23:15:47.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure AMD Turin Dasv7, Easv7, and Fasv7-series Virtual Machines",
      "link": "https://azure.microsoft.com/updates?id=552318",
      "description": "The general purpose Dasv7 and Dalsv7, memory-optimized Easv7, and compute-optimized Fasv7, Falsv7, Famsv7 VMs, are now generally available with and without local disk support. These VMs are available in the following Azure regions: Australia East, Central",
      "japaneseTitle": "一般提供開始: Azure AMD Turin Dasv7, Easv7, および Fasv7 シリーズ仮想マシン",
      "japaneseDescription": "汎用の Dasv7 と Dalsv7、メモリ最適化の Easv7、コンピューティング最適化の Fasv7、Falsv7、Famsv7 仮想マシンが、ローカル ディスク サポートの有無に関係なく、一般提供開始となりました。これらの仮想マシンは、オーストラリア東部、中央などの Azure リージョンで利用可能です。",
      "technicalTags": [
        "Azure",
        "AMD Turin",
        "Dasv7",
        "Easv7",
        "Fasv7"
      ],
      "extractedLinks": [],
      "date": "2026-01-28T19:15:24.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Databricks Agent Bricks Knowledge Assistant",
      "link": "https://azure.microsoft.com/updates?id=542455",
      "description": "Azure Databricks Agent Bricks knowledge assistant empowers you to create, deploy, and manage AI agents directly within the Azure Databricks platform, using unified data and AI capabilities. This feature simplifies agent development by providing prebuilt c",
      "japaneseTitle": "一般提供開始: Azure Databricks Agent Bricks ナレッジ アシスタント",
      "japaneseDescription": "Azure Databricks Agent Bricks ナレッジ アシスタントを使用すると、Azure Databricks プラットフォーム内で、統一されたデータと AI 機能を使用して、AI エージェントを作成、展開、管理できます。この機能により、事前に構築されたコンポーネントを提供することで、エージェントの開発が簡素化されます。",
      "technicalTags": [
        "Azure Databricks",
        "AI"
      ],
      "extractedLinks": [],
      "date": "2026-01-28T18:45:08.000Z"
    },
    {
      "title": "[Launched] Generally Available: Latest PostgreSQL minor versions supported by Azure Database for PostgreSQL – Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=550164",
      "description": "PostgreSQL minor versions 18.1, 17.7, 16.11, 15.15, 14.20, and 13.23 are now supported by Azure Database for PostgreSQL – Flexible Server.    These minor version upgrades are automatically performed as part of the monthly planned maintenance in Azure Data",
      "japaneseTitle": "一般提供開始: Azure Database for PostgreSQL – Flexible Server でサポートされる最新の PostgreSQL マイナーバージョン",
      "japaneseDescription": "PostgreSQL マイナーバージョン 18.1、17.7、16.11、15.15、14.20、および 13.23 が Azure Database for PostgreSQL – Flexible Server でサポートされるようになりました。これらのマイナーバージョンのアップグレードは、Azure Data の毎月の計画メンテナンスの一環として自動的に実行されます。",
      "technicalTags": [
        "Azure Database for PostgreSQL",
        "PostgreSQL",
        "Flexible Server"
      ],
      "extractedLinks": [],
      "date": "2026-01-28T17:00:53.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure NetApp Files support in OpenShift Virtualization",
      "link": "https://azure.microsoft.com/updates?id=550466",
      "description": "Azure NetApp Files now\r\nenables fast virtual machine (VM) provisioning, instant cloning, and live\r\nmigration in OpenShift Virtualization. It offers seamlessly scalable storage\r\nwith predictable performance and enterprise data management for VM workloads\r\nfrom",
      "japaneseTitle": "プレビュー: Azure NetApp Files を使用した OpenShift Virtualization",
      "japaneseDescription": "Azure NetApp Files は、OpenShift Virtualization で仮想マシン (VM) の迅速なプロビジョニング、インスタント クローニング、ライブ マイグレーションを可能にします。予測可能なパフォーマンスとエンタープライズ データ管理を備えたスケーラブルなストレージを提供し、仮想マシン ワークロードのニーズに対応します。",
      "technicalTags": [
        "Azure NetApp Files",
        "OpenShift Virtualization",
        "VM"
      ],
      "extractedLinks": [],
      "date": "2026-01-27T17:00:06.000Z"
    },
    {
      "title": "[In preview] Public Preview: 7th generation Intel-based VMs – Dlsv7/Dsv7/Esv7",
      "link": "https://azure.microsoft.com/updates?id=529407",
      "description": "Announcing the preview of new Azure Dlsv7/Dsv7 General Purpose and Esv7 Memory Optimized Virtual Machines (VMs) powered by the latest Intel® Xeon® 6 processors (Granite Rapids). The latest Azure Intel-based v7 VMs are designed to power ever increasing com",
      "japaneseTitle": "プレビュー: 7世代IntelベースのVM – Dlsv7/Dsv7/Esv7",
      "japaneseDescription": "Intel Xeon 6プロセッサ（Granite Rapids）を搭載した新しいAzure Dlsv7/Dsv7汎用仮想マシンとEsv7メモリ最適化仮想マシンのプレビューを発表します。最新のAzure Intelベースのv7 VMは、増加するコンピューティング需要に対応するために設計されています。",
      "technicalTags": [
        "Intel Xeon",
        "Dlsv7",
        "Dsv7",
        "Esv7"
      ],
      "extractedLinks": [],
      "date": "2026-01-27T17:00:06.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Command Launcher for Java",
      "link": "https://azure.microsoft.com/updates?id=543994",
      "description": "At Microsoft Ignite 2025, we announced the Public Preview of the Azure Command Launcher for Java, a new JVM launcher optimized specifically for Azure. This tool provides better default ergonomics for Java applications running in containers and virtual mac",
      "japaneseTitle": "プレビュー: Azure Command Launcher for Java",
      "japaneseDescription": "Microsoft Ignite 2025では、Azure専用に最適化された新しいJVMランチャーであるAzure Command Launcher for Javaのパブリックプレビューを発表しました。このツールは、コンテナと仮想マシンで実行されるJavaアプリケーションに、デフォルトで優れたエргノミクスを提供します。",
      "technicalTags": [
        "Azure Command Launcher",
        "Java",
        "JVM"
      ],
      "extractedLinks": [],
      "date": "2026-01-27T14:00:07.000Z"
    },
    {
      "title": "[Launched] Generally Available: Deployment safeguards – pod security standard support in AKS",
      "link": "https://azure.microsoft.com/updates?id=548101",
      "description": "Organizations deploying workloads on Kubernetes often need a consistent way\r\nto enforce pod security configurations across clusters. Azure Kubernetes\r\nService (AKS) now supports Pod Security Standards within Deployment Safeguards,\r\nenabling centralized manag",
      "japaneseTitle": "一般提供開始: デプロイのセーフガード – AKSにおけるポッドセキュリティ標準のサポート",
      "japaneseDescription": "Kubernetesでワークロードをデプロイする組織は、クラスター全体でポッドセキュリティ構成を一貫して適用する方法が必要です。Azure Kubernetes Service (AKS) では、デプロイのセーフガード内でポッドセキュリティ標準をサポートし、集中管理を可能にしました。",
      "technicalTags": [
        "Azure Kubernetes Service",
        "Kubernetes",
        "Pod Security Standards"
      ],
      "extractedLinks": [],
      "date": "2026-01-22T22:30:50.000Z"
    },
    {
      "title": "[Launched] Generally Available: StandardV2 NAT Gateway with zone-redundancy and StandardV2 public IPs",
      "link": "https://azure.microsoft.com/updates?id=547772",
      "description": "StandardV2 SKU NAT Gateway is now generally available, delivering enhanced resiliency, greater performance, and dual-stack connectivity, all at the same price as the Standard SKU.  StandardV2 Public IP addresses and prefixes are also generally available.",
      "japaneseTitle": "一般提供開始: StandardV2 NAT ゲートウェイと StandardV2 パブリック IP",
      "japaneseDescription": "StandardV2 SKU NAT ゲートウェイが一般提供開始され、ゾーン冗長性と StandardV2 パブリック IP を提供し、Standard SKU と同じ価格で高可用性、パフォーマンス、デュアルスタック接続を実現します。",
      "technicalTags": [
        "NAT Gateway",
        "StandardV2",
        "Public IP"
      ],
      "extractedLinks": [],
      "date": "2026-01-22T17:30:31.000Z"
    },
    {
      "title": "[Launched] Generally Available: Reporting in Playwright Workspaces (part of Azure App Testing)",
      "link": "https://azure.microsoft.com/updates?id=550379",
      "description": "Reporting capabilities are now live in Playwright Workspaces. The latest update brings you an integrated, flexible and collaborative reporting experience designed to make debugging tests in Playwright Workspaces easier, faster and more efficient. Customer",
      "japaneseTitle": "一般提供開始: Playwright Workspacesのレポート機能 (Azure App Testingの一部)",
      "japaneseDescription": "Playwright Workspacesでレポート機能が利用可能になりました。この最新の更新により、Playwright Workspacesでのテストのデバッグをより簡単、迅速、効率的に行えるように設計された統合された、柔軟性の高い、共同作業可能なレポート体験が提供されます。",
      "technicalTags": [
        "Playwright Workspaces",
        "Azure App Testing"
      ],
      "extractedLinks": [],
      "date": "2026-01-22T17:00:03.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Load Testing in Switzerland North",
      "link": "https://azure.microsoft.com/updates?id=550685",
      "description": "Azure Load Testing capability in Azure App Testing is now generally available in Switzerland North. Customers can now use Azure Load Testing, a fully managed load-testing service to generate high scale load and run simulations, easily identify performance",
      "japaneseTitle": "一般提供開始: Azure Load Testing in Switzerland North",
      "japaneseDescription": "Azure App TestingのAzure Load Testing機能がスイス北部で一般提供開始されました。顧客は、Azure Load Testingを使用して、高スケールの負荷を生成し、シミュレーションを実行し、パフォーマンスの問題を簡単に特定できます。",
      "technicalTags": [
        "Azure Load Testing",
        "Azure App Testing"
      ],
      "extractedLinks": [],
      "date": "2026-01-22T00:00:08.000Z"
    },
    {
      "title": "[Launched] Generally Available: Application volume group for Oracle create data protection volume group (API)",
      "link": "https://azure.microsoft.com/updates?id=548066",
      "description": "The functionality of application volume group for Oracle has been expanded with the ability to create data protection volumes in a volume group with the same anti-affinity layout as production volume groups. Customers benefit from this ability for creatin",
      "japaneseTitle": "一般提供: Oracle 用アプリケーションボリュームグループでデータ保護ボリュームグループを作成する (API)",
      "japaneseDescription": "Oracle 用アプリケーションボリュームグループの機能が拡張され、プロダクション ボリュームグループと同じアンチアフィニティ レイアウトでデータ保護ボリュームをボリュームグループ内に作成できるようになりました。顧客は、この機能を使用してデータ保護ボリュームを作成し、データの保護と可用性を向上させることができます。",
      "technicalTags": [
        "Oracle",
        "API"
      ],
      "extractedLinks": [],
      "date": "2026-01-22T00:00:08.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure File Sync in Israel Central",
      "link": "https://azure.microsoft.com/updates?id=548974",
      "description": "Azure File Sync enables seamless tiering of data from on-premises Windows Servers to Azure Files for hybrid use cases and simplified migration. It also enables you to leverage the performance, flexibility and compatibility of your on-premises File Server",
      "japaneseTitle": "一般提供開始: Azure File Sync in Israel Central",
      "japaneseDescription": "Azure File Syncは、オンプレミスのWindowsサーバーからAzure Filesへのデータのシームレスな階層化を可能にし、ハイブリッドユースケースと簡素化された移行を実現します。また、オンプレミスのファイルサーバーのパフォーマンス、柔軟性、互換性を活用できます。",
      "technicalTags": [
        "Azure File Sync",
        "Azure Files",
        "Windows Servers"
      ],
      "extractedLinks": [],
      "date": "2026-01-21T22:15:11.000Z"
    },
    {
      "title": "[Launched] Generally Available: Ubuntu 24.04 support in AKS",
      "link": "https://azure.microsoft.com/updates?id=548096",
      "description": "Customers\r\nupgrading AKS clusters often need a clear and flexible path to adopt new OS\r\nversions without disrupting workloads. Ubuntu 24.04 is now generally\r\navailable on AKS starting with Kubernetes version 1.32, with containerd 2.0 enabled by default.  It",
      "japaneseTitle": "一般提供開始: AKSでのUbuntu 24.04のサポート",
      "japaneseDescription": "AKSクラスターをアップグレードする際、顧客はワークロードを中断せずに新しいOSバージョンを採用するための明確で柔軟なパスが必要です。Ubuntu 24.04は、Kubernetesバージョン1.32から開始し、デフォルトでcontainerd 2.0を有効にして、AKSで一般提供されます。",
      "technicalTags": [
        "AKS",
        "Ubuntu",
        "Kubernetes",
        "containerd"
      ],
      "extractedLinks": [],
      "date": "2026-01-21T18:00:07.000Z"
    },
    {
      "title": "[In preview] Public Preview: User delegation SAS for Azure Tables, Azure Files, and Azure Queues",
      "link": "https://azure.microsoft.com/updates?id=548987",
      "description": "User delegation SAS for Azure Tables, Azure Files, and Azure Queues is now available in public preview. User delegation (UDK) SAS is already generally available for blobs, and this release extends that support to tables, files, and queues.User delegation",
      "japaneseTitle": "プレビュー: Azure Tables、Azure Files、Azure Queues のユーザー委任 SAS",
      "japaneseDescription": "Azure Tables、Azure Files、Azure Queues のユーザー委任 SAS がパブリック プレビューで利用可能になりました。ユーザー委任 (UDK) SAS は、既に BLOB に一般提供されており、このリリースにより、テーブル、ファイル、キューにもサポートが拡張されました。",
      "technicalTags": [
        "Azure Tables",
        "Azure Files",
        "Azure Queues",
        "User Delegation SAS"
      ],
      "extractedLinks": [],
      "date": "2026-01-16T17:00:49.000Z"
    },
    {
      "title": "[Launched] Generally Available: Ubuntu 24.04 support in AKS",
      "link": "https://azure.microsoft.com/updates?id=536550",
      "description": "Ubuntu 24.04 is now generally available on AKS in Kubernetes\r\nversion 1.32 and above. Containerd 2.0 is enabled by default. Ubuntu 24.04 is\r\ndefault with `Ubuntu` OS Sku in kubernetes version 1.35 and above. There are two ways that Ubuntu 24.04 can be enabl",
      "japaneseTitle": "一般提供開始: AKSでのUbuntu 24.04のサポート",
      "japaneseDescription": "Ubuntu 24.04は、Kubernetesバージョン1.32以上のAKSで一般提供開始されました。Containerd 2.0はデフォルトで有効になっています。Kubernetesバージョン1.35以上では、Ubuntu OS SkuのデフォルトがUbuntu 24.04になります。Ubuntu 24.04を有効にする方法は2つあります。",
      "technicalTags": [
        "AKS",
        "Kubernetes",
        "Ubuntu",
        "Containerd"
      ],
      "extractedLinks": [],
      "date": "2026-01-14T22:45:12.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Cosmos DB Mirroring with Private Endpoints",
      "link": "https://azure.microsoft.com/updates?id=543086",
      "description": "Available now in Public Preview, you can configure Azure Cosmos DB accounts with virtual networks or private endpoints to work with Microsoft Fabric mirroring. This feature allows you to preserve your enhanced network security and seamlessly replicate you",
      "japaneseTitle": "プレビュー: Azure Cosmos DB ミラーリング with プライベート エンドポイント",
      "japaneseDescription": "Azure Cosmos DB アカウントを仮想ネットワークまたはプライベート エンドポイントで構成し、Microsoft Fabric ミラーリングで動作させることができるようになりました。この機能により、強化されたネットワーク セキュリティを維持しながら、データをシームレスにレプリケートできます。",
      "technicalTags": [
        "Azure Cosmos DB",
        "Microsoft Fabric",
        "Private Endpoints"
      ],
      "extractedLinks": [],
      "date": "2026-01-09T14:30:36.000Z"
    },
    {
      "title": "[Launched] Generally Available: Cloud-native apps on Kubernetes pricing calculator scenario",
      "link": "https://azure.microsoft.com/updates?id=536560",
      "description": "The new cloud-native apps on\r\nKubernetes pricing calculator scenario allows teams to estimate the total cost\r\nof ownership for a production-ready AKS cluster with other key Azure services,\r\nincluding Azure Container Registry, Azure Monitoring, Microsoft Defe",
      "japaneseTitle": "一般提供開始: Kubernetes のクラウドネイティブ アプリの価格計算シナリオ",
      "japaneseDescription": "新しいクラウドネイティブ アプリの Kubernetes 価格計算シナリオにより、チームは、Azure Container Registry、Azure Monitoring、Microsoft Defender などの他の重要な Azure サービスを含む、プロダクションレディの AKS クラスターの総所有コストを推定できます。",
      "technicalTags": [
        "Kubernetes",
        "AKS",
        "Azure Container Registry",
        "Azure Monitoring",
        "Microsoft Defender"
      ],
      "extractedLinks": [],
      "date": "2025-12-31T21:00:35.000Z"
    },
    {
      "title": "[Launched] Generally Available: Geo-Replication for Azure Service Bus Premium",
      "link": "https://azure.microsoft.com/updates?id=490149",
      "description": "The Geo-Replication feature for Azure Service Bus in the\r\npremium tier is now generally available. The Service Bus Geo-Replication\r\nfeature is one of the options to insulate\r\nAzure Service Bus applications against outages and disasters, providing\r\nreplication",
      "japaneseTitle": "一般提供開始: Azure Service Bus Premium の Geo レプリケーション",
      "japaneseDescription": "Azure Service Bus の Premium レベルで Geo レプリケーション機能が一般提供開始されました。Service Bus の Geo レプリケーション機能は、アウトエージと災害から Azure Service Bus アプリケーションを保護するためのオプションの一つであり、レプリケーションを提供します。",
      "technicalTags": [
        "Azure Service Bus",
        "Geo-Replication"
      ],
      "extractedLinks": [],
      "date": "2025-12-31T21:00:35.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Premium SSD v2 Disk is now available in Austria East and in a second Availability Zone in Japan West",
      "link": "https://azure.microsoft.com/updates?id=544080",
      "description": "Azure Premium SSD v2 is now available in Austria East and in a second Availability Zone in Japan West.  Azure Premium SSD v2, a next-generation general-purpose block storage solution, offers sub-millisecond latencies and exceptional price performance for",
      "japaneseTitle": "一般提供開始: Azure Premium SSD v2 ディスクがオーストリア東部と日本西部の 2 番目の可用性ゾーンで利用可能になりました",
      "japaneseDescription": "Azure Premium SSD v2 は、オーストリア東部と日本西部の 2 番目の可用性ゾーンで利用可能になりました。Azure Premium SSD v2 は、次世代の汎用ブロックストレージソリューションであり、サブミリ秒の待ち時間と優れた価格性能を提供します。",
      "technicalTags": [
        "Azure Premium SSD v2",
        "Availability Zone"
      ],
      "extractedLinks": [],
      "date": "2025-12-31T20:45:49.000Z"
    },
    {
      "title": "Retirement: Deprecation of Custom Resource Providers",
      "link": "https://azure.microsoft.com/updates?id=513892",
      "description": "In 2026, Azure Resource Manager will be deprecating the Custom Resource Provider (CuRP) service.We will retire the feature by October 31, 2026. We will be performing a scream test on October 27, 2025, as part of this deprecation. On July 31, 2026, creates",
      "japaneseTitle": "廃止: カスタム リソース プロバイダーの非推奨",
      "japaneseDescription": "2026 年には、Azure Resource Manager でカスタム リソース プロバイダー (CuRP) サービスが非推奨になります。この機能は 2026 年 10 月 31 日に廃止されます。非推奨の一環として、2025 年 10 月 27 日にスクリーム テストを実行します。2026 年 7 月 31 日には、CuRP を使用した新しいリソースの作成ができなくなります。",
      "technicalTags": [
        "Azure Resource Manager",
        "Custom Resource Provider"
      ],
      "extractedLinks": [],
      "date": "2025-12-29T17:30:40.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Blob-to-Blob migration made simple with Azure Storage Mover",
      "link": "https://azure.microsoft.com/updates?id=542813",
      "description": "Azure Storage Mover’s new Azure Blob container-to-container\r\nmigration feature is now in Public Preview, empowering organizations to move\r\ndata between two Blob containers within the same or different storage accounts, subscriptions or Azure regions securel",
      "japaneseTitle": "プレビュー: Azure Blob-to-Blob 移行を簡素化する Azure Storage Mover",
      "japaneseDescription": "Azure Storage Mover の新しい Azure Blob コンテナ間移行機能がパブリック プレビューに公開され、組織が同じまたは異なるストレージ アカウント、サブスクリプション、または Azure リージョン内の 2 つの Blob コンテナ間でデータを安全に移動できるようになりました。",
      "technicalTags": [
        "Azure Storage Mover",
        "Azure Blob",
        "Azure Storage"
      ],
      "extractedLinks": [],
      "date": "2025-12-18T18:45:03.000Z"
    },
    {
      "title": "[In preview] Public Preview: Service Bus SDK type bindings in Azure Functions for Node.js",
      "link": "https://azure.microsoft.com/updates?id=541427",
      "description": "Azure\r\nFunctions triggers and bindings enable you to easily integrate event and data\r\nsources with function applications.   Now that SDK\r\ntype bindings support for Azure Blob Storage is available, we’re also\r\nintroducing support for Service Bus SDK type bindi",
      "japaneseTitle": "プレビュー: Azure Functions for Node.js での Service Bus SDK 型バインディング",
      "japaneseDescription": "Azure Functions のトリガーとバインディングを使用すると、イベントとデータ ソースを関数アプリケーションに簡単に統合できます。Azure Blob Storage の SDK 型バインディング サポートが利用可能になったため、Service Bus の SDK 型バインディング サポートも導入しています。",
      "technicalTags": [
        "Azure Functions",
        "Service Bus",
        "Node.js",
        "Azure Blob Storage"
      ],
      "extractedLinks": [],
      "date": "2025-12-17T18:45:01.000Z"
    },
    {
      "title": "[Launched] Generally Avaailable: Azure SQL updates for early December 2025",
      "link": "https://azure.microsoft.com/updates?id=541818",
      "description": "In mid-December 2025, the following updates and enhancements were made to Azure SQL:  Identify causes that auto-resume serverless workloads using Activity Log in Azure SQL Database to troubleshoot and optimize access patterns. Learn more.",
      "japaneseTitle": "一般提供開始: Azure SQL 2025年12月初旬の更新",
      "japaneseDescription": "2025年12月中旬、Azure SQL に以下の更新と強化が行われました: Azure SQL Database で Activity Log を使用して、自動再開サーバーレス ワークロードの原因を特定し、最適化とアクセス パターンのトラブルシューティングを行うことができます。詳細はこちらを参照してください。",
      "technicalTags": [
        "Azure SQL",
        "Azure SQL Database",
        "Activity Log"
      ],
      "extractedLinks": [],
      "date": "2025-12-17T18:30:05.000Z"
    },
    {
      "title": "[In preview] Public Preview: Use Azure SRE Agent with Azure Cosmos DB",
      "link": "https://azure.microsoft.com/updates?id=541813",
      "description": "You can now simplify how you diagnose and resolve issues in your applications running on Azure Cosmos DB with the introduction of the Azure Cosmos DB Site Reliability Engineering (SRE) Agent, built on the Azure SRE Agent platform. This new capability give",
      "japaneseTitle": "プレビュー: Azure SRE エージェントを Azure Cosmos DB で使用",
      "japaneseDescription": "Azure Cosmos DB で実行されているアプリケーションの問題を診断して解決する方法が簡素化されました。Azure SRE エージェント プラットフォームを基に構築された Azure Cosmos DB サイト信頼性エンジニアリング (SRE) エージェントが導入されたためです。この新しい機能により、Azure Cosmos DB で実行されているアプリケーションの問題をより効率的に解決できるようになります。",
      "technicalTags": [
        "Azure Cosmos DB",
        "Azure SRE Agent"
      ],
      "extractedLinks": [],
      "date": "2025-12-17T18:30:05.000Z"
    },
    {
      "title": "[In preview] Generally Available: Azure NetApp Files cross-zone-region replication (CZRR)",
      "link": "https://azure.microsoft.com/updates?id=537106",
      "description": "Cross-zone-region replication builds on the existing capabilities of cross-region replication and cross-zone replication. It enables you to replicate volumes across regions and across availability zones within the same region, combining disaster recovery",
      "japaneseTitle": "プレビュー: Azure NetApp Files 跨ゾーン・リージョン レプリケーション (CZRR) が一般提供開始",
      "japaneseDescription": "跨ゾーン・リージョン レプリケーションは、既存の跨リージョン レプリケーションと跨ゾーン レプリケーションの機能を基盤にしています。これにより、同じリージョン内の可用性ゾーン間およびリージョン間でボリュームをレプリケートできるようになり、災害復旧の機能が強化されます。",
      "technicalTags": [
        "Azure NetApp Files",
        "cross-zone replication",
        "cross-region replication"
      ],
      "extractedLinks": [],
      "date": "2025-12-16T15:45:45.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure NetApp Files advanced ransomware protection",
      "link": "https://azure.microsoft.com/updates?id=536699",
      "description": "Azure NetApp Files advanced ransomware protection (ANF ARP) is now in Public Preview.  ANF ARP is designed to help organizations proactively detect, respond to, and recover from ransomware threats on cloud volumes. ANF ARP monitors Azure NetApp Files volu",
      "japaneseTitle": "プレビュー: Azure NetApp Files の高度なランサムウェア保護",
      "japaneseDescription": "Azure NetApp Files の高度なランサムウェア保護 (ANF ARP) がパブリック プレビューにリリースされました。ANF ARP は、クラウド ボリュームでのランサムウェアの脅威をプロアクティブに検出、対応、復旧することを目的として設計されています。ANF ARP は Azure NetApp Files のボリュームを監視し、ランサムウェアの攻撃を検出すると、自動的に通知と対応を開始します。この機能は、クラウド ストレージのセキュリティとデータの保護を強化するために役立ちます。",
      "technicalTags": [
        "Azure NetApp Files",
        "ANF ARP"
      ],
      "extractedLinks": [],
      "date": "2025-12-16T15:45:45.000Z"
    },
    {
      "title": "Update: The retirement date for default outbound access has been extended to March 31, 2026.",
      "link": "https://azure.microsoft.com/updates?id=515484",
      "description": "The retirement date for default outbound access has been extended to March 31, 2026. This change aligns with the broader Azure Virtual Network (VNet) update and replaces the previously communicated September 30, 2025 date. Starting March 31, 2026, newly c",
      "japaneseTitle": "デフォルトのアウトバウンドアクセスの廃止日が2026年3月31日に延期",
      "japaneseDescription": "デフォルトのアウトバウンドアクセスの廃止日が2026年3月31日に延期されました。この変更は、Azure Virtual Network (VNet) の更新に合わせて行われ、以前発表されていた2025年9月30日の日付に代わるものです。2026年3月31日以降、新しく作成されたすべてのリソースでは、デフォルトのアウトバウンドアクセスが無効になります。",
      "technicalTags": [
        "Azure Virtual Network",
        "VNet"
      ],
      "extractedLinks": [],
      "date": "2025-12-12T11:30:27.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Databricks Dashboard subscriptions now support Microsoft Teams",
      "link": "https://azure.microsoft.com/updates?id=536907",
      "description": "You can now receive insights where collaboration happens—in Microsoft Teams—with expanded dashboard subscription capabilities in Azure Databricks. This enhancement delivers timely, actionable data directly into team workflows, reducing the need to check e",
      "japaneseTitle": "プレビュー: Azure Databricks ダッシュボードのサブスクリプションで Microsoft Teams がサポートされる",
      "japaneseDescription": "Azure Databricks のダッシュボード サブスクリプション機能が強化され、Microsoft Teams でインサイトを受け取ることができるようになりました。この機能強化により、チームのワークフローに直接、タイムリーでアクション可能なデータが提供され、電子メールを確認する必要が減ります。",
      "technicalTags": [
        "Azure Databricks",
        "Microsoft Teams"
      ],
      "extractedLinks": [],
      "date": "2025-12-11T20:30:24.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Sphere OS version 25.12 is now available for evaluation",
      "link": "https://azure.microsoft.com/updates?id=541784",
      "description": "Azure Sphere OS version 25.12 is now available for evaluation in the Retail Eval feed. Whilst this release encompasses no customer-facing changes, it represents significant under-the-hood build system changes, as such, this release will operate for an ext",
      "japaneseTitle": "一般提供開始: Azure Sphere OS バージョン 25.12 が評価用に利用可能",
      "japaneseDescription": "Azure Sphere OS バージョン 25.12 が Retail Eval フィードで評価用に利用可能になりました。このリリースには顧客向けの変更は含まれていませんが、内部的なビルド システムの変更が含まれており、評価用として利用可能です。",
      "technicalTags": [
        "Azure Sphere OS"
      ],
      "extractedLinks": [],
      "date": "2025-12-11T18:00:36.000Z"
    },
    {
      "title": "[Launched] Generally Available: FIPS compliant mode for Application Gateway V2 SKUs",
      "link": "https://azure.microsoft.com/updates?id=536712",
      "description": "The Federal Information Processing Standard (FIPS) 140-2\r\nis a US government standard that defines minimum security requirements for\r\ncryptographic modules in information technology products and systems. Azure Application Gateway V2 now supports FIPS mode,",
      "japaneseTitle": "一般提供: Application Gateway V2 SKU の FIPS 準拠モード",
      "japaneseDescription": "連邦情報処理標準 (FIPS) 140-2 は、情報技術製品およびシステムの暗号化モジュールに対する最低限のセキュリティ要件を定義する米国政府の標準です。Azure Application Gateway V2 では、FIPS モードがサポートされ、暗号化モジュールのセキュリティ要件を満たします。",
      "technicalTags": [
        "Application Gateway",
        "FIPS"
      ],
      "extractedLinks": [],
      "date": "2025-12-09T13:15:11.000Z"
    },
    {
      "title": "[Launched] Generally Available: Zonal placement for Azure file shares Azure Files Premium LRS in select regions.",
      "link": "https://azure.microsoft.com/updates?id=541410",
      "description": "Zonal Placement for Azure Files Premium LRS is now GA in select regions! This capability gives you explicit control over zone locality by pinning storage accounts to a specific availability zone, enabling high availability, fault isolation, and predictabl",
      "japaneseTitle": "一般提供開始: Azure ファイル共有のゾーン配置 - Azure Files Premium LRS (一部リージョン)",
      "japaneseDescription": "Azure Files Premium LRS のゾーン配置機能が、一部のリージョンで一般提供開始されました。この機能により、ストレージ アカウントを特定の可用性ゾーンに固定することで、高可用性、障害分離、予測可能性が実現します。",
      "technicalTags": [
        "Azure Files",
        "Azure Files Premium LRS",
        "Zonal Placement"
      ],
      "extractedLinks": [],
      "date": "2025-12-05T21:45:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Mistral Large 3 in Foundry",
      "link": "https://azure.microsoft.com/updates?id=536937",
      "description": "Mistral Large 3, a frontier-class open-weight model with Apache 2.0 licensing, is now available in Microsoft Foundry on Azure. This model delivers enterprise-grade reliability, long-context comprehension, and multimodal reasoning—making it ideal for produ",
      "japaneseTitle": "プレビュー: FoundryでMistral Large 3を公開",
      "japaneseDescription": "Mistral Large 3は、Apache 2.0ライセンスの最先端クラスのオープンウェイトモデルで、Microsoft Foundry on Azureで利用可能になりました。このモデルは、企業レベルの信頼性、長文の理解、多様な推論を提供し、製品に最適です。",
      "technicalTags": [
        "Mistral Large 3",
        "Apache 2.0",
        "Microsoft Foundry",
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-12-04T22:30:44.000Z"
    },
    {
      "title": "[Launched] Generally Availaible: Azure MCP Server support for Azure confidential ledger",
      "link": "https://azure.microsoft.com/updates?id=531889",
      "description": "The Azure MCP (Model Context Protocol) Server provides a\r\nstreamlined approach for managing Azure resources—including Azure confidential ledger—through\r\nnatural language prompts. This feature allows users to interact with confidential\r\nledger without the nee",
      "japaneseTitle": "一般提供開始: Azure MCP サーバーによる Azure 機密レジャーのサポート",
      "japaneseDescription": "Azure MCP (モデル コンテキスト プロトコル) サーバーは、自然言語プロンプトを使用して Azure リソース、包括して Azure 機密レジャーを管理するためのストリームライン化されたアプローチを提供します。この機能により、ユーザーは機密レジャーと対話することができ、必要な手順を実行することができます。Azure MCP サーバーは、Azure リソースの管理を簡素化し、ユーザーが Azure サービスの機能をより効率的に利用できるようにします。",
      "technicalTags": [
        "Azure MCP",
        "Azure Confidential Ledger",
        "Model Context Protocol"
      ],
      "extractedLinks": [],
      "date": "2025-12-04T17:00:18.000Z"
    },
    {
      "title": "[In preview] Public Preview: Serverless workspaces in Azure Databricks",
      "link": "https://azure.microsoft.com/updates?id=536721",
      "description": "Serverless workspaces in Azure Databricks are now available in Public Preview, offering a fully managed workspace type that comes preconfigured with serverless compute and default storage to deliver an enterprise-ready SaaS experience with minimal infrast",
      "japaneseTitle": "プレビュー: Azure Databricks のサーバーレス ワークスペース",
      "japaneseDescription": "Azure Databricks のサーバーレス ワークスペースがパブリック プレビューで利用可能になりました。これは、サーバーレス コンピューティングとデフォルトのストレージが事前に構成された、フルに管理されたワークスペース タイプであり、最小限のインフラストラクチャでエンタープライズ レディの SaaS エクスペリエンスを提供します。",
      "technicalTags": [
        "Azure Databricks",
        "Serverless"
      ],
      "extractedLinks": [],
      "date": "2025-12-04T16:15:01.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Blob Storage SFTP - Resumable Uploads",
      "link": "https://azure.microsoft.com/updates?id=499438",
      "description": "Announcing the general availability of resumable uploads for\r\nAzure Storage Blob SFTP. In the event of a failed partial transfer, this new\r\nfeature enables users to open the partial file and continue writing the\r\nremaining content. This capability optimizes",
      "japaneseTitle": "一般提供開始: Azure Blob Storage SFTP - 再開可能なアップロード",
      "japaneseDescription": "Azure Storage Blob SFTPの再開可能なアップロード機能が一般提供開始されました。この機能により、部分的な転送に失敗した場合、ユーザーは部分ファイルを開き、残りのコンテンツの書き込みを続行できます。この機能により、転送の最適化が可能になります。",
      "technicalTags": [
        "Azure Blob Storage",
        "SFTP"
      ],
      "extractedLinks": [],
      "date": "2025-12-04T12:00:46.000Z"
    },
    {
      "title": "Retirement: Remove dependency on these Azure ML SDKs before June 30, 2026",
      "link": "https://azure.microsoft.com/updates?id=501668",
      "description": "On June 30, 2026, AzureML SDK V1 will reach end of life. The following SDKs which work in tandem with the AzureML SDK V1 will also be retired.  azureml-train-core  azureml-pipeline  azureml-pipeline-core  azureml-pipeline-internal  azureml-pipeline-steps",
      "japaneseTitle": "廃止: 2026年6月30日までにこれらのAzure ML SDKへの依存を解除してください",
      "japaneseDescription": "2026年6月30日、AzureML SDK V1はサポート終了となります。AzureML SDK V1と連携して動作する以下のSDKも廃止されます: azureml-train-core、azureml-pipeline、azureml-pipeline-core、azureml-pipeline-internal、azureml-pipeline-steps",
      "technicalTags": [
        "AzureML",
        "azureml-train-core",
        "azureml-pipeline",
        "azureml-pipeline-core",
        "azureml-pipeline-internal",
        "azureml-pipeline-steps"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T21:00:12.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Database for PostgreSQL Flexible Server in Belgium Central",
      "link": "https://azure.microsoft.com/updates?id=534523",
      "description": "Now you can deploy Azure Database for PostgreSQL Flexible Server in the Belgium Central Azure region.  Learn more.",
      "japaneseTitle": "一般提供開始: Azure Database for PostgreSQL Flexible Server (ベルギー中部)",
      "japaneseDescription": "Azure Database for PostgreSQL Flexible Serverをベルギー中部のAzureリージョンでデプロイできるようになりました。詳細についてはこちらを参照してください。",
      "technicalTags": [
        "Azure Database for PostgreSQL Flexible Server",
        "PostgreSQL"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T17:30:15.000Z"
    },
    {
      "title": "[Launched] Generally Available: Update pg_squeeze to version 1.9.1 in Azure Database for PostgreSQL Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=534518",
      "description": "Now you can upgrade the pg_squeeze extension to version 1.9.1 in Azure Database for PostgreSQL Flexible Server.  Learn more.",
      "japaneseTitle": "一般提供: Azure Database for PostgreSQL Flexible Server で pg_squeeze をバージョン 1.9.1 に更新",
      "japaneseDescription": "Azure Database for PostgreSQL Flexible Server で、pg_squeeze 拡張機能をバージョン 1.9.1 にアップグレードできるようになりました。詳細については、こちらを参照してください。",
      "technicalTags": [
        "PostgreSQL",
        "pg_squeeze",
        "Azure Database"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T17:30:15.000Z"
    },
    {
      "title": "[Launched] Generally Available: The ip4r extension in Azure Database for PostgreSQL Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=534509",
      "description": "Now you can install the ip4r extension in Azure Database for PostgreSQL Flexible Server. Ip4r provides efficient storage and indexing functionality for IPv4 and IPv6 addresses and ranges.  Learn more.",
      "japaneseTitle": "一般提供開始: Azure Database for PostgreSQL Flexible Server での ip4r 拡張機能",
      "japaneseDescription": "Azure Database for PostgreSQL Flexible Server で ip4r 拡張機能をインストールできるようになりました。ip4r は、IPv4 および IPv6 アドレスと範囲に対する効率的なストレージとインデックス機能を提供します。詳細については、こちらを参照してください。",
      "technicalTags": [
        "Azure Database for PostgreSQL Flexible Server",
        "ip4r",
        "PostgreSQL"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T17:30:15.000Z"
    },
    {
      "title": "[Launched] Generally Available: The credcheck extension in Azure Database for PostgreSQL Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=534504",
      "description": "Now you can install the credcheck extension in Azure\r\nDatabase for PostgreSQL Flexible Server. The credcheck extension helps you to\r\nenforce password and credential validation policies directly within PostgreSQL.\r\n Learn\r\nmore.",
      "japaneseTitle": "一般提供開始: Azure Database for PostgreSQL Flexible Server の credcheck 拡張機能",
      "japaneseDescription": "Azure Database for PostgreSQL Flexible Server で credcheck 拡張機能をインストールできるようになりました。credcheck 拡張機能を使用すると、PostgreSQL 内で直接パスワードと資格情報の検証ポリシーを適用できます。詳細については、こちらを参照してください。",
      "technicalTags": [
        "Azure Database for PostgreSQL Flexible Server",
        "credcheck",
        "PostgreSQL"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T17:30:15.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Load Balancer bandwidth metrics now support Protocol dimension",
      "link": "https://azure.microsoft.com/updates?id=536747",
      "description": "Bandwidth metrics for Azure Load\r\nBalancer are now published with metric dimension Protocol. When retrieving or\r\nviewing Byte, Packet, and SYN Count metrics in the Azure portal, you will now\r\nsee the dimension Protocol. TCP traffic is denoted by Protocol=6,",
      "japaneseTitle": "一般提供: Azure Load Balancer 帯域幅メトリックがProtocol 次元をサポート",
      "japaneseDescription": "Azure Load Balancer の帯域幅メトリックは、メトリック次元 Protocol で公開されるようになりました。Azure ポータルで Byte、Packet、SYN Count メトリックを取得または表示するときに、Protocol 次元が表示されるようになります。TCP トラフィックは、Protocol=6 で表されます。",
      "technicalTags": [
        "Azure Load Balancer",
        "TCP"
      ],
      "extractedLinks": [],
      "date": "2025-12-03T17:00:27.000Z"
    },
    {
      "title": "[Launched] Generally Available: Perth - Azure Extended Zones",
      "link": "https://azure.microsoft.com/updates?id=535363",
      "description": "We are announcing the general availability of the Perth\r\nAzure Extended Zone.   Azure Extended Zones are small-footprint extensions of Azure\r\nplaced in metro areas, industry centers, or specific jurisdictions, to serve\r\nlow latency and data residency workloa",
      "japaneseTitle": "一般提供開始: パース - Azure Extended Zones",
      "japaneseDescription": "パースのAzure Extended Zoneが一般提供開始されました。Azure Extended Zonesは、低遅延とデータ居住性ワークロードをサポートするために、都市部、産業センター、または特定の管轄区域に設置されたAzureの小規模拡張です。",
      "technicalTags": [
        "Azure Extended Zones"
      ],
      "extractedLinks": [],
      "date": "2025-12-01T17:30:38.000Z"
    },
    {
      "title": "[In preview] Public Preview: Managed Identity support in Network Watcher VNET flow log, traffic analytics and packet capture",
      "link": "https://azure.microsoft.com/updates?id=534482",
      "description": "VNET flow log captures IP\r\ntraffic flowing through VNETs, subnets, and NICs for monitoring, troubleshooting,\r\nnetwork optimization, security, and compliance needs and stores the logs in Azure\r\nStorage Traffic Analytics leverages\r\nVNET flow logs and aggregates",
      "japaneseTitle": "プレビュー: ネットワーク ウォッチャー VNET フロー ログ、トラフィック分析、パケット キャプチャでのマネージド ID サポート",
      "japaneseDescription": "VNET フロー ログは、VNET、サブネット、NIC を経由する IP トラフィックをキャプチャし、監視、トラブルシューティング、ネットワーク最適化、セキュリティ、コンプライアンスのニーズに応えるために Azure Storage にログを保存します。トラフィック分析は VNET フロー ログを活用し、アグリゲーションを行います。",
      "technicalTags": [
        "Network Watcher",
        "VNET",
        "Azure Storage",
        "Traffic Analytics"
      ],
      "extractedLinks": [],
      "date": "2025-11-25T16:45:50.000Z"
    },
    {
      "title": "[In preview] Public Preview: Claude Opus 4.5 Available in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=534541",
      "description": "Claude Opus 4.5 is now available in public preview on\r\nMicrosoft Foundry, bringing advanced coding, agentic workflows, and enterprise\r\nproductivity to Azure customers. Claude Opus 4.5 sets a new benchmark for performance\r\nand versatility, outperforming previ",
      "japaneseTitle": "プレビュー: Claude Opus 4.5 が Microsoft Foundry で利用可能",
      "japaneseDescription": "Claude Opus 4.5 が Microsoft Foundry でパブリック プレビューとして利用可能になり、Azure の顧客向けに高度なコーディング、エージェント ワークフロー、エンタープライズ プロダクティビティを提供します。Claude Opus 4.5 は、パフォーマンスと多様性の新しい基準を設定し、以前のバージョンを上回る成果を示しています。",
      "technicalTags": [
        "Microsoft Foundry",
        "Claude Opus"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T20:30:10.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure File Sync in New Zealand North",
      "link": "https://azure.microsoft.com/updates?id=533437",
      "description": "Azure File Sync enables seamless tiering of data from on-premises Windows Servers to Azure Files for hybrid use cases and simplified migration. It also enables you to leverage the performance, flexibility and compatibility of your on-premises File Server",
      "japaneseTitle": "一般提供開始: Azure File Sync in New Zealand North",
      "japaneseDescription": "Azure File Syncは、オンプレミスのWindowsサーバーからAzure Filesへのデータのシームレスな階層化を可能にし、ハイブリッドユースケースと簡素化された移行を実現します。また、オンプレミスのファイルサーバーのパフォーマンス、柔軟性、互換性を活用できます。",
      "technicalTags": [
        "Azure File Sync",
        "Azure Files",
        "Windows Servers"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T18:00:42.000Z"
    },
    {
      "title": "[In preview] Public Preview: Entra ID support for RDP connections",
      "link": "https://azure.microsoft.com/updates?id=526018",
      "description": "Announcing Azure Bastion now supports Microsoft Entra ID\r\nauthentication for RDP connections to Windows VMs directly in the portal. This update\r\nbrings two key benefits for RDP users connecting to their virtual machines: Enhanced Security: By eliminating lo",
      "japaneseTitle": "プレビュー: Entra ID を使用した RDP 接続のサポート",
      "japaneseDescription": "Azure Bastion で Microsoft Entra ID 認証を使用した Windows 仮想マシンへの RDP 接続が直接ポータルでサポートされるようになりました。この更新により、RDP ユーザーが仮想マシンに接続する際に 2 つの主な利点がもたらされます。セキュリティの強化: ローカル アカウントの使用を排除することで、セキュリティが向上します。また、管理オーバーヘッドの削減: Azure Active Directory (Azure AD) 資格情報を使用して仮想マシンにアクセスできるため、管理が簡素化されます。",
      "technicalTags": [
        "Azure Bastion",
        "Microsoft Entra ID",
        "RDP",
        "Windows VM"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T17:15:03.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Load Testing in Italy North",
      "link": "https://azure.microsoft.com/updates?id=532481",
      "description": "Azure Load Testing capability in Azure App Testing is now generally available in Italy North. Customers can now use Azure Load Testing, a fully managed load-testing service to generate high scale load and run simulations, easily identify performance bottl",
      "japaneseTitle": "一般提供開始: Azure Load Testing がイタリア北部で利用可能",
      "japaneseDescription": "Azure App Testing の Azure Load Testing 機能がイタリア北部で一般提供開始されました。顧客は、Azure Load Testing を使用して、高スケールの負荷を生成し、シミュレーションを実行し、パフォーマンスのボトルネックを簡単に特定できます。",
      "technicalTags": [
        "Azure Load Testing",
        "Azure App Testing"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T17:00:10.000Z"
    },
    {
      "title": "[Launched] Generally Available: Regex support in T-SQL",
      "link": "https://azure.microsoft.com/updates?id=532207",
      "description": "Boost your SQL queries with powerful regular expressions (regex) support for advanced pattern matching. Now you can use native regex in T-SQL directly in Azure SQL and SQL Server 2025 queries—simplifying code, improving maintainability, and reducing depen",
      "japaneseTitle": "一般提供: T-SQLでの正規表現サポート",
      "japaneseDescription": "SQLクエリを強化するために、正規表現（regex）を使用した高度なパターンマッチングをサポートします。Azure SQLおよびSQL Server 2025のクエリで、ネイティブの正規表現を直接使用できるようになりました。これにより、コードの簡素化、保守性の向上、依存関係の削減が実現します。",
      "technicalTags": [
        "T-SQL",
        "Azure SQL",
        "SQL Server"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T17:00:10.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure MCP Server for Azure Database for MySQL",
      "link": "https://azure.microsoft.com/updates?id=532197",
      "description": "Announcing that Azure MCP Server now supports Azure Database for MySQL. With this update, you can empower AI agents and applications to interact with your MySQL data using natural language through the open Model Context Protocol (MCP). Instead of writing",
      "japaneseTitle": "一般提供開始: Azure MCP サーバー for Azure Database for MySQL",
      "japaneseDescription": "Azure MCP サーバーが Azure Database for MySQL をサポートすることを発表します。この更新により、AI エージェントとアプリケーションが、オープンな Model Context Protocol (MCP) を使用して、自然言語で MySQL データとやり取りすることができます。コードを書く代わりに、MCP を使用して MySQL データにアクセスできます。",
      "technicalTags": [
        "Azure Database for MySQL",
        "Model Context Protocol",
        "MCP"
      ],
      "extractedLinks": [],
      "date": "2025-11-24T17:00:10.000Z"
    },
    {
      "title": "[Launched] Generally Available: Custom handler support in Azure Functions Flex consumption",
      "link": "https://azure.microsoft.com/updates?id=512413",
      "description": "Azure Functions now supports custom\r\nhandlers in Flex consumption. Custom handlers are lightweight web servers that\r\nreceive events from the Functions host. Any language that supports HTTP\r\nprimitives can implement a custom handler.  Custom handlers are best",
      "japaneseTitle": "一般提供: Azure Functions Flex 消費でのカスタム ハンドラーのサポート",
      "japaneseDescription": "Azure Functions では、Flex 消費でのカスタム ハンドラーのサポートが提供されます。カスタム ハンドラーは、Functions ホストからイベントを受信する軽量な Web サーバーです。HTTP プリミティブをサポートする任意の言語でカスタム ハンドラーを実装できます。カスタム ハンドラーは、柔軟性とカスタマイズ性を提供するため、ベスト プラクティスとして推奨されます。",
      "technicalTags": [
        "Azure Functions",
        "HTTP"
      ],
      "extractedLinks": [],
      "date": "2025-11-21T19:15:38.000Z"
    },
    {
      "title": "Retirement: Migrate to dedicated VM for your compute clusters",
      "link": "https://azure.microsoft.com/updates?id=501658",
      "description": "On September 30, 2025, Low-Priority VM will reach end of life. However, you will continue to be supported on Azure Machine Learning until March 31, 2026.  To ensure that your clusters are not automatically scaled down it is recommended to migrate to dedic",
      "japaneseTitle": "廃止: コンピューティング クラスターの専用 VM への移行",
      "japaneseDescription": "2025 年 9 月 30 日に、Low-Priority VM は終了します。しかし、2026 年 3 月 31 日までは Azure Machine Learning でサポートが続けられます。クラスターが自動的にスケール ダウンされないようにするには、専用 VM への移行を推奨します。",
      "technicalTags": [
        "Low-Priority VM",
        "Azure Machine Learning"
      ],
      "extractedLinks": [],
      "date": "2025-11-21T18:45:18.000Z"
    },
    {
      "title": "[In preview] Public Preview: Container network metrics filtering in Advanced Container Networking Services for (ACNS) for AKS",
      "link": "https://azure.microsoft.com/updates?id=523076",
      "description": "Container network metrics\r\nfiltering in Azure Container Networking Services (ACNS) is now available in\r\npublic preview. In\r\ncontainerized environments, the ingestion of excessive network metrics can lead\r\nto inflated storage costs and cluttered dashboards, ma",
      "japaneseTitle": "プレビュー: Advanced Container Networking Services (ACNS) for AKS のコンテナ ネットワーク メトリック フィルタリング",
      "japaneseDescription": "Azure Container Networking Services (ACNS) のコンテナ ネットワーク メトリック フィルタリングがパブリック プレビューで利用可能になりました。コンテナ化された環境では、過剰なネットワーク メトリックの取り込みにより、ストレージ コストが増加し、ダッシュボードが混雑する可能性があります。この機能により、不要なメトリックをフィルタリングして、ストレージ コストを削減し、ダッシュボードの混雑を軽減できます。",
      "technicalTags": [
        "ACNS",
        "AKS",
        "Azure Container Networking Services"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T20:00:10.000Z"
    },
    {
      "title": "[Launched] Generally Available: MCP support for AI toolchain operator add-on in AKS",
      "link": "https://azure.microsoft.com/updates?id=523152",
      "description": "MCP support for AI toolchain operator add-on is\r\nnow Generally Available.    The AI Toolchain Operator add-on now supports\r\nKAITO inference workspaces with integrated tool calling and Model Context\r\nProtocol (MCP), addressing key challenges around dynamic mo",
      "japaneseTitle": "一般提供開始: MCPをサポートしたAIツールチェーンオペレーター アドオン for AKS",
      "japaneseDescription": "MCPをサポートしたAIツールチェーンオペレーター アドオンが一般提供開始されました。AIツールチェーンオペレーター アドオンは、KAITO推論ワークスペースと統合ツール呼び出しおよびモデルコンテキストプロトコル(MCP)をサポートし、動的モデル管理の重要な課題に対処します。",
      "technicalTags": [
        "AKS",
        "MCP",
        "KAITO",
        "AI Toolchain Operator"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T18:45:04.000Z"
    },
    {
      "title": "[Launched] Generally Available: Cluster-wide Cilium network policy with Azure CNI powered by Cilium for AKS",
      "link": "https://azure.microsoft.com/updates?id=523120",
      "description": "Cluster-wide Cilium network\r\npolicy for AKS clusters using Azure CNI powered by Cilium is now Generally\r\nAvailable.   Managing consistent network policies across Kubernetes\r\nnamespaces has long been a challenge for platform teams, especially in\r\nmulti-tenant",
      "japaneseTitle": "一般提供開始: Azure CNI powered by Cilium を使用した AKS クラスターのクラスター全体の Cilium ネットワーク ポリシー",
      "japaneseDescription": "Azure CNI powered by Cilium を使用した AKS クラスターのクラスター全体の Cilium ネットワーク ポリシーが一般提供開始されました。Kubernetes ネームスペース全体にわたる一貫したネットワーク ポリシーの管理は、特にマルチテナント環境において、プラットフォーム チームにとって長年の課題でした。",
      "technicalTags": [
        "Azure CNI",
        "Cilium",
        "AKS",
        "Kubernetes"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T18:30:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Local redirect policy in Azure CNI powered by Cilium for AKS",
      "link": "https://azure.microsoft.com/updates?id=523081",
      "description": "Local redirect policy with Azure\r\nCNI powered by Cilium for AKS is now generally available. Customers running high-scale AKS workloads often experience\r\nlatency and performance bottlenecks due to cross-node traffic routing. The new local\r\nredirect policy add",
      "japaneseTitle": "一般提供開始: Azure CNI powered by Cilium for AKS のローカル リダイレクト ポリシー",
      "japaneseDescription": "Azure CNI powered by Cilium for AKS のローカル リダイレクト ポリシーが一般提供されました。AKS の大規模なワークロードを実行する顧客は、ノード間のトラフィック ルーティングにより待ち時間とパフォーマンスのボトルネックを頻繁に経験します。この新しいローカル リダイレクト ポリシーは、クロス ノード トラフィック ルーティングの待ち時間とパフォーマンスのボトルネックを解消するために役立ちます。",
      "technicalTags": [
        "Azure CNI",
        "Cilium",
        "AKS"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T18:30:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Layer 7 policy with Advanced Container Networking Services (ACNS) for AKS",
      "link": "https://azure.microsoft.com/updates?id=523115",
      "description": "To address the growing need for granular traffic control in\r\nmicroservices architectures, Azure Container Networking Services now offers\r\nLayer 7 Policy as a generally available feature. This capability empowers\r\ncustomers to enforce fine-grained traffic con",
      "japaneseTitle": "一般提供開始: AKS 用 Advanced Container Networking Services (ACNS) の Layer 7 ポリシー",
      "japaneseDescription": "マイクロサービス アーキテクチャにおける粒度の細かいトラフィック制御の需要に応えるために、Azure Container Networking Services は、Layer 7 ポリシーを一般提供開始しました。この機能により、顧客は細粒度のトラフィック制御を実施できます。AKS (Azure Kubernetes Service) での Advanced Container Networking Services を使用すると、顧客はマイクロサービス間のトラフィックをより詳細に制御できるようになります。",
      "technicalTags": [
        "Layer 7",
        "Advanced Container Networking Services",
        "ACNS",
        "AKS",
        "Azure Kubernetes Service"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T18:15:25.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure NetApp Files single file restore from backup",
      "link": "https://azure.microsoft.com/updates?id=522077",
      "description": "With Azure NetApp Files single file restore from backup, you can restore individual files from Azure NetApp Files backup vault without needing to restore an entire volume. By restoring only the necessary files, you can save time and cost needed for restor",
      "japaneseTitle": "一般提供開始: Azure NetApp Files のバックアップからの単一ファイルの復元",
      "japaneseDescription": "Azure NetApp Files のバックアップからの単一ファイルの復元機能により、Azure NetApp Files のバックアップボールトから個々のファイルを復元できます。ボリューム全体を復元する必要がないため、復元に必要な時間とコストを節約できます。",
      "technicalTags": [
        "Azure NetApp Files"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T18:15:25.000Z"
    },
    {
      "title": "[Launched] Generally Available: DNS security policy Threat Intelligence feed",
      "link": "https://azure.microsoft.com/updates?id=530183",
      "description": "Azure\r\nDNS security policy Threat Intelligence feed is now generally available.\r\nProtect against known malicious domains with Microsoft’s managed Threat\r\nIntelligent feed.  Smart Protection  \r\n Almost all attacks begin with\r\n     a DNS query. Threat Intelligen",
      "japaneseTitle": "一般提供開始: DNS セキュリティ ポリシーの脅威インテリジェンス フィード",
      "japaneseDescription": "Azure DNS セキュリティ ポリシーの脅威インテリジェンス フィードが一般提供開始されました。マイクロソフトの管理された脅威インテリジェンス フィードを使用して、既知の悪意のあるドメインから保護します。ほとんどの攻撃は DNS クエリから始まるため、脅威インテリジェンスを活用してセキュリティを強化できます。",
      "technicalTags": [
        "DNS",
        "Threat Intelligence"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T17:00:13.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Sphere OS version 25.10 is now available",
      "link": "https://azure.microsoft.com/updates?id=522390",
      "description": "Azure Sphere OS version 25.10 is now available in the Retail feed. This release includes updates to Azure Sphere OS only; it does not include an updated SDK. If your devices are connected to the internet, they will receive the updated OS from the cloud.Th",
      "japaneseTitle": "一般提供開始: Azure Sphere OS バージョン 25.10 が利用可能",
      "japaneseDescription": "Azure Sphere OS バージョン 25.10 が Retail フィードで利用可能になりました。このリリースでは、Azure Sphere OS のみが更新され、SDK の更新は含まれていません。デバイスがインターネットに接続されている場合、クラウドから更新された OS を受信します。",
      "technicalTags": [
        "Azure Sphere OS",
        "Azure Sphere"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T16:00:12.000Z"
    },
    {
      "title": "[Launched] Generally Available: Trusted Launch is now supported for Arm64 Marketplace Images",
      "link": "https://azure.microsoft.com/updates?id=529797",
      "description": "Announcing that\r\nTrusted Launch supported Arm64 Images are now available in the Azure\r\nMarketplace. You can now get the dual benefit of cost and performance efficiencies\r\nof Arm64 in addition to the security benefits of Trusted Launch.  Arm64 VMs bring cost",
      "japaneseTitle": "一般提供開始: Arm64 マーケットプレイス イメージで Trusted Launch がサポートされる",
      "japaneseDescription": "Arm64 マーケットプレイス イメージで Trusted Launch がサポートされたことを発表します。Azure マーケットプレイスで Arm64 イメージの Trusted Launch を利用できるようになりました。Arm64 仮想マシンは、コストとパフォーマンスの効率性に加えて、Trusted Launch のセキュリティ利点も提供します。",
      "technicalTags": [
        "Arm64",
        "Trusted Launch",
        "Azure Marketplace"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T15:00:59.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure NetApp Files migration assistant (portal support)",
      "link": "https://azure.microsoft.com/updates?id=525620",
      "description": "Azure NetApp Files migration assistant (with SnapMirror) provides efficient and cost-effective data migration leveraging ONTAP's built-in replication engine for seamless transition from on-premises or CVO/other cloud providers to Azure NetApp Files (ANF).",
      "japaneseTitle": "プレビュー: Azure NetApp Files 移行アシスタント (ポータル サポート)",
      "japaneseDescription": "Azure NetApp Files 移行アシスタント (SnapMirror を使用) は、ONTAP の組み込みレプリケーション エンジンを活用して、オンプレミスまたは CVO/他のクラウド プロバイダーから Azure NetApp Files (ANF) への移行を効率的かつコスト効率の高い方法で実現します。",
      "technicalTags": [
        "Azure NetApp Files",
        "SnapMirror",
        "ONTAP"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T13:45:47.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure NetApp Files cache volumes",
      "link": "https://azure.microsoft.com/updates?id=523917",
      "description": "Azure NetApp Files cache volumes are now available in public preview. The cache volumes feature is a new capability built on NetApp’s ONTAP FlexCache technology that provides a persistent, high-performance cache in Azure for data stored on ONTAP-based sto",
      "japaneseTitle": "プレビュー: Azure NetApp Files キャッシュ ボリューム",
      "japaneseDescription": "Azure NetApp Files キャッシュ ボリュームがパブリック プレビューで利用できるようになりました。キャッシュ ボリューム機能は、NetApp の ONTAP FlexCache テクノロジーを基盤にして構築された新しい機能であり、ONTAP ベースのストレージに保存されたデータのために Azure で永続的かつ高パフォーマンスのキャッシュを提供します。",
      "technicalTags": [
        "Azure NetApp Files",
        "ONTAP",
        "FlexCache"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T13:45:47.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Monitor for Azure Arc-enabled Kubernetes with OpenShift and Azure Red Hat OpenShift",
      "link": "https://azure.microsoft.com/updates?id=530174",
      "description": "Azure Monitor provides a complete set of services for monitoring the health and performance of different layers of your Kubernetes infrastructure and the applications that depend on it.Azure Monitor now supports Azure Arc-enabled Kubernetes with OpenShift",
      "japaneseTitle": "プレビュー: Azure Monitor for Azure Arc対応Kubernetes with OpenShiftとAzure Red Hat OpenShift",
      "japaneseDescription": "Azure Monitorは、Kubernetesインフラストラクチャのさまざまなレイヤーとそれに依存するアプリケーションのヘルスとパフォーマンスを監視するためのサービスを提供します。Azure Monitorは、Azure Arc対応Kubernetes with OpenShiftとAzure Red Hat OpenShiftをサポートしています。",
      "technicalTags": [
        "Azure Monitor",
        "Azure Arc",
        "Kubernetes",
        "OpenShift",
        "Azure Red Hat OpenShift"
      ],
      "extractedLinks": [],
      "date": "2025-11-20T08:00:32.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Managed Lustre Support for Azure MCP Server",
      "link": "https://azure.microsoft.com/updates?id=529381",
      "description": "Azure Managed Lustre now offers full integration with Azure MCP Server, and this capability is generally available. Azure MCP Server enables developers and infrastructure teams to manage Azure resources—including Azure Managed Lustre file systems—using na",
      "japaneseTitle": "一般提供開始: Azure Managed Lustre で Azure MCP サーバーをサポート",
      "japaneseDescription": "Azure Managed Lustre では、Azure MCP サーバーとの完全な統合が提供され、この機能は一般に提供されています。Azure MCP サーバーを使用すると、開発者とインフラストラクチャ チームは、Azure Managed Lustre ファイル システムを含む Azure リソースを管理できます。",
      "technicalTags": [
        "Azure Managed Lustre",
        "Azure MCP Server"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T21:00:38.000Z"
    },
    {
      "title": "[Launched] Generally Available: CSI Dynamic Provisioning for Azure Managed Lustre",
      "link": "https://azure.microsoft.com/updates?id=529368",
      "description": "CSI Dynamic Provisioning for Azure Managed Lustre (AMLFS) is now generally available. With dynamic provisioning, Kubernetes applications can request AMLFS-backed persistent volumes on demand using standard StorageClass and PersistentVolumeClaim objects—no",
      "japaneseTitle": "一般提供開始: Azure Managed Lustre の CSI ダイナミック プロビジョニング",
      "japaneseDescription": "Azure Managed Lustre (AMLFS) の CSI ダイナミック プロビジョニングが一般提供開始されました。ダイナミック プロビジョニングにより、Kubernetes アプリケーションは、標準の StorageClass と PersistentVolumeClaim オブジェクトを使用して、必要に応じて AMLFS バックの永続ボリュームを要求できます。",
      "technicalTags": [
        "CSI",
        "Azure Managed Lustre",
        "Kubernetes",
        "StorageClass",
        "PersistentVolumeClaim"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T21:00:38.000Z"
    },
    {
      "title": "[In preview] Public Preview: 20 MB/s/TiB Performance Tier for Azure Managed Lustre",
      "link": "https://azure.microsoft.com/updates?id=529359",
      "description": "Azure Managed Lustre now offers a new 20 MB/s/TiB performance tier in public preview, designed to meet the demands of large-scale AI and high-performance computing (HPC) workloads. This tier enables customers to provision file systems up to 25 PiB in a si",
      "japaneseTitle": "プレビュー: Azure Managed Lustre の 20 MB/s/TiB パフォーマンス ティア",
      "japaneseDescription": "Azure Managed Lustre では、現在パブリック プレビューとして、20 MB/s/TiB の新しいパフォーマンス ティアが提供されており、大規模な AI および高性能コンピューティング (HPC) ワークロードの需要に応えるように設計されています。このティアにより、顧客は 25 PiB までのファイル システムをプロビジョニングできます。",
      "technicalTags": [
        "Azure Managed Lustre",
        "HPC"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T21:00:38.000Z"
    },
    {
      "title": "[In preview] Public Preview: Auto-import for Azure Managed Lustre",
      "link": "https://azure.microsoft.com/updates?id=529342",
      "description": "The Auto-import feature for Azure Managed Lustre (AMLFS) is now available in public preview. Auto-import enables seamless, policy-driven synchronization of data from Azure Blob Storage containers into AMLFS clusters, automatically reflecting new, changed,",
      "japaneseTitle": "プレビュー: Azure Managed Lustre の自動インポート",
      "japaneseDescription": "Azure Managed Lustre (AMLFS) の自動インポート機能がパブリック プレビューで利用可能になりました。自動インポートにより、Azure Blob Storage コンテナーから AMLFS クラスターへのデータの同期がシームレスに、ポリシー駆動で行われ、新規または変更されたデータが自動的に反映されます。",
      "technicalTags": [
        "Azure Managed Lustre",
        "Azure Blob Storage"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T20:00:49.000Z"
    },
    {
      "title": "[In preview] Public Preview: Recommended alerts for Azure Monitor Workspace",
      "link": "https://azure.microsoft.com/updates?id=515505",
      "description": "Azure Monitor now offers one-click enablement of recommended alerts directly in the Azure Portal for Azure Monitor Managed service for Prometheus customers. These alerts enable you to monitor the ingestion limits for Azure Monitor Workspace and avoid metr",
      "japaneseTitle": "プレビュー: Azure Monitor Workspace の推奨アラート",
      "japaneseDescription": "Azure Monitor では、Azure Monitor Managed service for Prometheus の顧客が Azure Portal で 1 回のクリックで推奨アラートを有効にすることができます。これらのアラートにより、Azure Monitor Workspace のインジェスト制限を監視し、メトリックの制限を回避できます。",
      "technicalTags": [
        "Azure Monitor",
        "Azure Monitor Managed service for Prometheus"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:45:05.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Managed Redis integration with Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=532188",
      "description": "Azure Managed Redis is now available as part of the Microsoft Foundry MCP tools catalog, allowing customers to use Redis as a knowledge store or memory store for AI agents. This integration makes it simple to connect Redis to Foundry-based agents, enablin",
      "japaneseTitle": "プレビュー: Azure Managed Redis と Microsoft Foundry の統合",
      "japaneseDescription": "Azure Managed Redis が Microsoft Foundry MCP ツール カタログの一部として利用可能になり、顧客が Redis を知識ストアまたは AI エージェントのメモリ ストアとして使用できるようになりました。この統合により、Redis を Foundry ベースのエージェントに簡単に接続でき、AI エージェントの開発が容易になります。",
      "technicalTags": [
        "Azure Managed Redis",
        "Microsoft Foundry",
        "Redis"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:30:18.000Z"
    },
    {
      "title": "[Launched] Generally Available: TLS and TCP termination on Azure Application Gateway",
      "link": "https://azure.microsoft.com/updates?id=532202",
      "description": "Azure Application Gateway has introduced general availability support\r\nfor TLS and TCP protocol termination. This enhancement enables you to load\r\nbalance and securely process non-HTTP(S) traffic for applications that rely on\r\nTCP or TLS protocols. The gatew",
      "japaneseTitle": "一般提供開始: Azure Application Gateway での TLS および TCP 終端",
      "japaneseDescription": "Azure Application Gateway では、TLS および TCP プロトコルの終端に対する一般提供サポートが導入されました。この強化により、TCP または TLS プロトコルに依存するアプリケーションの非 HTTP(S) トラフィックをロードバランスして安全に処理できます。Azure Application Gateway を使用すると、Web アプリケーションのセキュリティとパフォーマンスを向上させることができます。",
      "technicalTags": [
        "Azure Application Gateway",
        "TLS",
        "TCP"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:00:30.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft Foundry data connection for Azure Databricks",
      "link": "https://azure.microsoft.com/updates?id=527678",
      "description": "Azure Databricks Genie is now integrated with Microsoft Foundry and in public preview. You can now connect Genie spaces directly to Microsoft Foundry agents using Model Context Protocol (MCP), giving you seamless access to trusted data for building intell",
      "japaneseTitle": "プレビュー: Microsoft Foundry データ接続 for Azure Databricks",
      "japaneseDescription": "Azure Databricks Genie が Microsoft Foundry と統合され、パブリック プレビューに移行しました。Genie スペースを Model Context Protocol (MCP) を使用して Microsoft Foundry エージェントに直接接続できるようになり、信頼できるデータにシームレスにアクセスしてインテリジェントな機能を構築できます。",
      "technicalTags": [
        "Azure Databricks",
        "Microsoft Foundry",
        "Model Context Protocol"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:00:30.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Databricks Genie in Copilot Studio",
      "link": "https://azure.microsoft.com/updates?id=527668",
      "description": "Azure Databricks Genie is now available in Microsoft Copilot Studio, giving you direct access to intelligent, enterprise-grade AI answers across your full Azure Databricks data estate. This integration unlocks enterprise-grade, conversational analytics ac",
      "japaneseTitle": "プレビュー: Azure Databricks Genie を Copilot Studio で使用",
      "japaneseDescription": "Azure Databricks Genie が Microsoft Copilot Studio で利用可能になり、Azure Databricks の全データ資産に対して、インテリジェントでエンタープライズグレードの AI アンサーに直接アクセスできるようになりました。この統合により、エンタープライズグレードの会話型アナリティクスが可能になります。",
      "technicalTags": [
        "Azure Databricks",
        "Microsoft Copilot Studio"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:00:30.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure API Management adds support for A2A Agent APIs",
      "link": "https://azure.microsoft.com/updates?id=527635",
      "description": "Announcing the public preview of A2A API support in Azure API Management.\r\nWith this new capability, organizations can manage and govern agent APIs\r\nalongside other API types — AI model APIs, Model Context Protocol (MCP) tools,\r\nand traditional APIs such as",
      "japaneseTitle": "プレビュー: Azure API Management で A2A エージェント API がサポートされる",
      "japaneseDescription": "Azure API Management で A2A API のサポートがパブリック プレビューとして利用可能になりました。この新しい機能により、組織は AI モデル API、Model Context Protocol (MCP) ツール、従来の API など他の API タイプとともにエージェント API を管理および統制できます。",
      "technicalTags": [
        "Azure API Management",
        "A2A API",
        "AI model APIs",
        "Model Context Protocol",
        "MCP"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T17:00:30.000Z"
    },
    {
      "title": "[In preview] Public Preview: Claude in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=532303",
      "description": "Claude models by Anthropic are now\r\navailable for Public Preview in Microsoft Foundry, expanding the platform’s unified ecosystem of\r\nfrontier AI. Enterprises can access Claude Sonnet 4.5, Opus 4.1, and Haiku 4.5\r\nfor advanced long-context reasoning, coding,",
      "japaneseTitle": "プレビュー: Microsoft Foundry での Claude のパブリック プレビュー",
      "japaneseDescription": "Anthropic の Claude モデルが Microsoft Foundry でパブリック プレビューとして利用可能になり、プラットフォームの統一されたフロンティア AI エコシステムが拡大しました。エンタープライズは、Claude Sonnet 4.5、Opus 4.1、Haiku 4.5 にアクセスして、先進的な長文脈推論、コーディングなどを行うことができます。",
      "technicalTags": [
        "Microsoft Foundry",
        "Claude",
        "Anthropic"
      ],
      "extractedLinks": [],
      "date": "2025-11-19T00:00:31.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Copilot agents - a closer look at the deployment agent",
      "link": "https://azure.microsoft.com/updates?id=526751",
      "description": "Following our Azure Copilot announcement introducing agentic\r\ncapabilities, this update focuses on one of the six new agents: the deployment\r\nagent. The deployment agent helps you discover, plan, and deploy cloud\r\nworkloads faster and with confidence using n",
      "japaneseTitle": "プレビュー: Azure Copilot エージェント - デプロイ エージェントの詳細",
      "japaneseDescription": "Azure Copilot の発表に続き、エージェント機能を紹介します。この更新では、6 つの新しいエージェントのうちの 1 つであるデプロイ エージェントに焦点を当てています。デプロイ エージェントは、クラウド ワークロードをより迅速かつ自信を持って発見、計画、デプロイするのに役立ちます。",
      "technicalTags": [
        "Azure Copilot",
        "deployment agent"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T20:15:19.000Z"
    },
    {
      "title": "[In development] Private Preview: Azure HorizonDB",
      "link": "https://azure.microsoft.com/updates?id=529806",
      "description": "Engineered for performance, Azure HorizonDB for PostgreSQL delivers future-proof, autoscaling storage up to 128 TB, up to 3 times faster performance than open-source PostgreSQL, and rapid compute scalability to 3,072 vCores. Now in private preview, Azure",
      "japaneseTitle": "開発中: プライベートプレビュー - Azure HorizonDB",
      "japaneseDescription": "パフォーマンスに特化したAzure HorizonDB for PostgreSQLは、将来にわたって安心できる、自動スケーリングストレージを最大128TB提供し、オープンソースPostgreSQLよりも最大3倍高速なパフォーマンスと、3,072の仮想コアまでの迅速なコンピューティングスケーラビリティを実現します。現在プライベートプレビュー中のAzure HorizonDBは、PostgreSQLワークロードのための次世代のクラウドネイティブデータベースプラットフォームです。",
      "technicalTags": [
        "PostgreSQL",
        "Azure HorizonDB",
        "vCores"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T18:00:28.000Z"
    },
    {
      "title": "[Launched] Generally Available: Private Marketplace for VS Code",
      "link": "https://azure.microsoft.com/updates?id=526909",
      "description": "The VS Code Private Marketplace is a secure, enterprise-ready way to host and manage extensions internally—fully integrated with VS Code. Teams can self-host, deploy easily, and manage updates with flexibility and control.Learn more.",
      "japaneseTitle": "一般提供開始: VS Code用プライベートマーケットプレイス",
      "japaneseDescription": "VS Codeプライベートマーケットプレイスは、企業向けにセキュアで統合された方法で拡張機能を内部でホストおよび管理するためのプラットフォームです。チームは拡張機能を自己ホストし、簡単にデプロイして、柔軟性と制御性を持って更新を管理できます。詳細はこちらを参照してください。",
      "technicalTags": [
        "VS Code"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T18:00:28.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft Defender for Cloud + GitHub Advanced Security",
      "link": "https://azure.microsoft.com/updates?id=526876",
      "description": "With Microsoft Defender for Cloud and GitHub Advanced\r\nSecurity, protect cloud-native applications across the full app lifecycle from\r\ncode to cloud. This natively integrated solution helps unify developers and\r\nsecurity teams in one workflow while staying i",
      "japaneseTitle": "プレビュー: Microsoft Defender for Cloud + GitHub Advanced Security",
      "japaneseDescription": "Microsoft Defender for CloudとGitHub Advanced Securityを使用して、コードからクラウドまでのフルアプリケーションライフサイクル全体でクラウドネイティブアプリケーションを保護します。このネイティブに統合されたソリューションは、開発者とセキュリティチームを1つのワークフローで統一するのに役立ちます。",
      "technicalTags": [
        "Microsoft Defender for Cloud",
        "GitHub Advanced Security"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T18:00:28.000Z"
    },
    {
      "title": "[In preview] Public Preview: Smart Tier account level tiering (Azure Blob Storage and ADLS)",
      "link": "https://azure.microsoft.com/updates?id=526188",
      "description": "Introducing smart tier Public Preview for account level\r\ntiering Announcing the public preview of smart\r\ntier for Azure Blob Storage and Azure Data Lake Storage (ADLS). Smart tier\r\nis a fully managed and automated data tiering solution, avoiding manual tier",
      "japaneseTitle": "[In preview] Public Preview: Smart Tier account level tiering (Azure Blob Storage and ADLS)",
      "japaneseDescription": "Introducing smart tier Public Preview for account level\r\ntiering Announcing the public preview of smart\r\ntier for Azure Blob Storage and Azure Data Lake Storage (ADLS). Smart tier\r\nis a fully managed and automated data tiering solution, avoiding manual tier",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T18:00:28.000Z"
    },
    {
      "title": "[In preview] Public Preview: Managed Instance on Azure App Service",
      "link": "https://azure.microsoft.com/updates?id=523623",
      "description": "Announcing Managed Instance on Azure App Service, now in Public Preview! This new capability makes it easy to move web apps to the cloud with minimal configuration—no code rewrites required. Whether your .NET apps run on-premises or in VMs, you can move t",
      "japaneseTitle": "プレビュー: Azure App Service のマネージド インスタンス",
      "japaneseDescription": "Azure App Service のマネージド インスタンスがパブリック プレビューで利用可能になりました。この新しい機能により、コードの書き直しが必要なく、最小限の構成で Web アプリをクラウドに移行できます。.NET アプリがオンプレミスまたは VM で実行されている場合でも、Azure に移行できます。",
      "technicalTags": [
        "Azure App Service",
        ".NET",
        "VM"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T18:00:28.000Z"
    },
    {
      "title": "[In development] Private Preview: Azure Boost confidential device",
      "link": "https://azure.microsoft.com/updates?id=530661",
      "description": "The\r\nAzure Boost confidential device feature is now in preview. Azure Boost\r\nis a Microsoft Azure system that offloads virtualization tasks—such as\r\nnetworking, storage, and host management—from the hypervisor and host OS to\r\npurpose-built hardware and softwa",
      "japaneseTitle": "開発中: プライベート プレビュー: Azure Boost 機密デバイス",
      "japaneseDescription": "Azure Boost 機密デバイス機能がプレビューに公開されました。Azure Boost は、Microsoft Azure システムで、ネットワーク、ストレージ、ホスト管理などの仮想化タスクをハイパーバイザーとホスト OS から、専用のハードウェアとソフトウェアにオフロードする機能です。",
      "technicalTags": [
        "Azure Boost",
        "hypervisor",
        "Microsoft Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft HTTP DDoS Ruleset 1.0 on Application Gateway WAF v2",
      "link": "https://azure.microsoft.com/updates?id=530609",
      "description": "Announcing the public preview\r\nof the HTTP DDoS Ruleset for Application Gateway WAF v2. HTTP-layer DDoS attacks remain a leading cause of\r\napplication downtime, and traditional static controls often fall short against\r\nevolving botnets. The new HTTP DDoS Rul",
      "japaneseTitle": "プレビュー: Microsoft HTTP DDoS ルールセット 1.0 on Application Gateway WAF v2",
      "japaneseDescription": "Application Gateway WAF v2 用の HTTP DDoS ルールセットのパブリック プレビューを発表します。HTTP レイヤーの DDoS 攻撃は、アプリケーションのダウンタイムの主な原因であり、従来の静的制御は進化するボットネットに対して効果が不足していることが多いです。新しい HTTP DDoS ルールセットは、HTTP レイヤーの DDoS 攻撃に対するより強力な保護を提供します。",
      "technicalTags": [
        "Application Gateway",
        "WAF",
        "HTTP DDoS"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In development] Private Preview: Azure Boost remote storage throughput and network bandwidth enhancements",
      "link": "https://azure.microsoft.com/updates?id=530287",
      "description": "Remote storage throughput and network bandwidth performance\r\nenhancements for the latest Azure Boost architecture are now in preview. Azure\r\nBoost is a Microsoft Azure system that offloads virtualization tasks—such as\r\nnetworking, storage, and host managemen",
      "japaneseTitle": "開発中: プライベートプレビュー - Azure Boost リモートストレージのスループットとネットワーク帯域幅の強化",
      "japaneseDescription": "Azure Boost の最新アーキテクチャのリモートストレージのスループットとネットワーク帯域幅のパフォーマンスが強化され、プレビューに公開されました。Azure Boost は、ネットワーク、ストレージ、ホスト管理などの仮想化タスクをオフロードする Microsoft Azure システムです。",
      "technicalTags": [
        "Azure Boost",
        "Microsoft Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: NCv6 Virtual Machines",
      "link": "https://azure.microsoft.com/updates?id=530208",
      "description": "We are announcing the public preview of NCv6 RTX PRO 6000 Blackwell\r\nServer Edition Virtual Machines, as the next enhancement of NC Series VMs\r\navailable on Azure.\r\nNvidia RTX PRO 6000 BSE GPUs are designed to accelerate a wide array of\r\nworkloads including v",
      "japaneseTitle": "プレビュー: NCv6 仮想マシン",
      "japaneseDescription": "NCv6 RTX PRO 6000 Blackwell Server Edition 仮想マシンのパブリック プレビューを発表します。これは、Azure で利用可能な NC シリーズ VM の次の強化版です。Nvidia RTX PRO 6000 BSE GPU は、仮想化されたワークロードを含む幅広いワークロードの高速化を目的として設計されています。",
      "technicalTags": [
        "NCv6",
        "Nvidia RTX PRO 6000",
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: New integration and extensibility capabilities to Azure SRE Agent",
      "link": "https://azure.microsoft.com/updates?id=529944",
      "description": "Azure SRE Agent is an AI-driven solution that unifies operational workflows into a single, prompt-based automation layer—eliminating complexity and reducing overhead for modern cloud operations. Unlike traditional, static automation solutions, SRE Agent l",
      "japaneseTitle": "プレビュー: Azure SRE エージェントの新しい統合および拡張機能",
      "japaneseDescription": "Azure SRE エージェントは、AI ドリブンのソリューションであり、運用ワークフローを単一のプロンプトベースの自動化レイヤーに統合し、複雑さを排除し、モダン クラウド運用のオーバーヘッドを削減します。従来の静的な自動化ソリューションとは異なり、SRE エージェントはクラウド運用の複雑さを解決するための高度な機能を提供します。",
      "technicalTags": [
        "Azure SRE Agent",
        "AI"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Advanced sampling and richer data collection in Azure Monitor OpenTelemetry Distro",
      "link": "https://azure.microsoft.com/updates?id=529519",
      "description": "Azure continues to embrace open standards by adding new capabilities to the Azure Monitor OpenTelemetry Distro that powers Azure Monitor Application Insights. New Capabilities:Rate-limited sampling and\r\ntrace-based log sampling:  New sampling options in\r\nth",
      "japaneseTitle": "一般提供: Azure Monitor OpenTelemetry Distro での高度なサンプリングとより豊富なデータ収集",
      "japaneseDescription": "Azure は、Azure Monitor Application Insights を動かす Azure Monitor OpenTelemetry Distro に新しい機能を追加し、オープン標準をさらに採用しています。新しい機能として、レート制限付きサンプリングとトレースベースのログサンプリングが追加されており、より柔軟なデータ収集と分析が可能になります。",
      "technicalTags": [
        "Azure Monitor",
        "OpenTelemetry",
        "Application Insights"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Network Watcher – Agentless Connection Troubleshoot",
      "link": "https://azure.microsoft.com/updates?id=527815",
      "description": "Agentless Connection Troubleshoot (public preview)\r\nintroduces a faster, simpler, and fully agentless way to diagnose network\r\nconnectivity issues across Azure resources. Previously, running connectivity\r\nchecks required installing the Network Watcher Extens",
      "japaneseTitle": "プレビュー: Azure Network Watcher – エージェントレス接続トラブルシューティング",
      "japaneseDescription": "エージェントレス接続トラブルシューティング（パブリックプレビュー）により、Azure リソース間のネットワーク接続性の問題を診断するためのより迅速で、シンプルで、完全にエージェントレスな方法が導入されました。以前は、接続性のチェックを実行するには、Network Watcher 拡張機能をインストールする必要がありましたが、この新しい機能により、エージェントのインストールが不要になり、ネットワーク接続性の問題の診断がより容易になりました。",
      "technicalTags": [
        "Azure Network Watcher",
        "Network Watcher Extens"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Network Watcher Topology – AKS Visualization",
      "link": "https://azure.microsoft.com/updates?id=527810",
      "description": "Azure Kubernetes Service (AKS) visualization in\r\nNetwork Watcher Topology (Public Preview) delivers end-to-end visibility of AKS\r\nclusters directly within the Azure networking experience. Customers can now\r\nexplore their Kubernetes environments, including th",
      "japaneseTitle": "プレビュー: Azure Network Watcher トポロジー - AKS 可視化",
      "japaneseDescription": "Azure Kubernetes Service (AKS) の可視化が Network Watcher トポロジー (パブリック プレビュー) で提供され、AKS クラスターのエンドツーエンドの可視性が Azure ネットワーク エクスペリエンス内で直接得られるようになりました。顧客は、Kubernetes 環境を含むクラスターを探索できるようになりました。",
      "technicalTags": [
        "Azure Kubernetes Service",
        "Network Watcher",
        "AKS"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure VNet Flow Log - Filtering",
      "link": "https://azure.microsoft.com/updates?id=527805",
      "description": "VNet Flow Log captures IP\r\ntraffic flowing through VNets, Subnets, & NICs for monitoring, troubleshooting,\r\nnetwork optimization, security, and compliance needs. This release introduces advanced filtering\r\ncapabilities in VNet Flow Logs, empowering users wit",
      "japaneseTitle": "プレビュー: Azure VNet フロー ログ - フィルタリング",
      "japaneseDescription": "VNet フロー ログは、VNet、サブネット、NIC を介した IP トラフィックをキャプチャし、監視、トラブルシューティング、ネットワーク最適化、セキュリティ、コンプライアンスのニーズに応える。このリリースでは、VNet フロー ログに高度なフィルタリング機能を導入し、ユーザーがトラフィックをより詳細に分析できるようにする。",
      "technicalTags": [
        "VNet",
        "VNet Flow Log",
        "NIC"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: ExpressRoute Scalable Gateway",
      "link": "https://azure.microsoft.com/updates?id=526729",
      "description": "ExpressRoute Scalable Gateway (ErGwScale) is our\r\nnext-generation offering that brings flexibility, performance, and operational\r\nsimplicity to Virtual Network Gateway deployments. With this release, you can\r\ndynamically scale gateway infrastructure to meet",
      "japaneseTitle": "一般提供開始: ExpressRoute スケーラブル ゲートウェイ",
      "japaneseDescription": "ExpressRoute スケーラブル ゲートウェイ (ErGwScale) は、仮想ネットワーク ゲートウェイの展開に柔軟性、パフォーマンス、運用の簡素化をもたらす次世代の提供サービスです。このリリースにより、ゲートウェイ インフラストラクチャを動的にスケールして需要に応えることができます。",
      "technicalTags": [
        "ExpressRoute",
        "Virtual Network Gateway"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Container Registry Repository Permissions with Attribute-based Access Control (ABAC)",
      "link": "https://azure.microsoft.com/updates?id=526644",
      "description": "Organizations\r\noperating Azure Container Registries (ACR) require least-privilege permissions\r\nover which Microsoft Entra identities can publish or consume container images.\r\nWith ACR repository permissions using attribute-based access control (ABAC),\r\nadmini",
      "japaneseTitle": "一般提供開始: Azure Container Registry リポジトリのアクセス制御に基づく属性ベースのアクセス制御 (ABAC) を使用した権限",
      "japaneseDescription": "Azure Container Registry (ACR) を操作する組織では、Microsoft Entra の ID がコンテナ イメージを公開または使用するための最小限の権限が必要です。ACR リポジトリの権限に属性ベースのアクセス制御 (ABAC) を使用すると、管理者は ID に特定の属性を割り当てることで、コンテナ イメージの公開と使用をより細かく制御できます。これにより、セキュリティとコンプライアンスを向上させることができます。",
      "technicalTags": [
        "Azure Container Registry",
        "Attribute-based Access Control",
        "Microsoft Entra"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Kubernetes Service desktop",
      "link": "https://azure.microsoft.com/updates?id=526242",
      "description": "AKS desktop delivers a modern, application-centric\r\nexperience for deploying and managing workloads on Azure Kubernetes Service.\r\nBuilt on supported AKS features, best practices, and the open-source Headlamp\r\nproject, it offers a guided, self-service interfa",
      "japaneseTitle": "プレビュー: Azure Kubernetes Service デスクトップ",
      "japaneseDescription": "AKS デスクトップは、Azure Kubernetes Service でワークロードをデプロイおよび管理するためのモダンでアプリケーション中心のエクスペリエンスを提供します。サポートされている AKS 機能、ベスト プラクティス、およびオープン ソースの Headlamp プロジェクトに基づいて構築されており、ガイド付きのセルフサービス インターフェイスを提供します。",
      "technicalTags": [
        "Azure Kubernetes Service",
        "AKS",
        "Headlamp"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Pod sandboxing on AKS",
      "link": "https://azure.microsoft.com/updates?id=526237",
      "description": "Running\r\ncontainerized workloads in shared environments can raise concerns around\r\nsecurity and workload isolation. To address this, AKS now supports pod\r\nsandboxing, enabling customers to run containers in per-workload pod VMs. Each\r\npod VM is isolated from",
      "japaneseTitle": "一般提供: AKSでのポッドサンドボックス",
      "japaneseDescription": "共有環境でコンテナ化されたワークロードを実行すると、セキュリティとワークロードの分離に関する懸念が生じることがあります。AKSでは、ポッドサンドボックスをサポートし、顧客がコンテナをワークロードごとのポッドVMで実行できるようにします。各ポッドVMは相互に分離されており、セキュリティと分離性を向上させます。",
      "technicalTags": [
        "AKS",
        "Pod sandboxing"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Managed namespaces on AKS",
      "link": "https://azure.microsoft.com/updates?id=526232",
      "description": "Managing\r\nnamespace configurations across AKS clusters has traditionally required manual\r\nsetup and ongoing maintenance, creating complexity and potential for\r\nmisconfiguration. With the general availability of Managed Namespaces, AKS now\r\nenables users to ea",
      "japaneseTitle": "一般提供: AKS のマネージド名前空間",
      "japaneseDescription": "AKS クラスター全体で名前空間の構成を管理するには、従来、手動での設定と継続的なメンテナンスが必要で、複雑さと誤設定の可能性が生じていました。マネージド名前空間の一般提供により、AKS はユーザーが名前空間の構成を簡単に管理できるようになりました。",
      "technicalTags": [
        "AKS",
        "Managed Namespaces"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Kubernetes Fleet Manager for Arc-enabled clusters",
      "link": "https://azure.microsoft.com/updates?id=526227",
      "description": "Managing\r\nKubernetes clusters across hybrid and multi-cloud environments can be complex\r\nand fragmented. To simplify this, Azure Kubernetes Fleet Manager now supports\r\nAzure Arc-enabled Kubernetes, enabling organizations to seamlessly manage any\r\nCNCF-complia",
      "japaneseTitle": "プレビュー: Azure Kubernetes Fleet Manager for Arc対応クラスター",
      "japaneseDescription": "ハイブリッドおよびマルチクラウド環境でのKubernetesクラスターの管理は複雑で断片化することがあります。この問題を解決するために、Azure Kubernetes Fleet ManagerはAzure Arc対応Kubernetesをサポートし、組織がCNCF準拠のクラスターをシームレスに管理できるようにします。",
      "technicalTags": [
        "Azure Kubernetes Fleet Manager",
        "Azure Arc",
        "Kubernetes",
        "CNCF"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Windows Server 2025 on AKS",
      "link": "https://azure.microsoft.com/updates?id=526213",
      "description": "Organizations running Windows-based\r\nworkloads on Azure Kubernetes Service (AKS) face increasing pressure to\r\nmodernize as support timelines for older Windows Server versions approach\r\nretirement. To help customers prepare, AKS now offers preview support for",
      "japaneseTitle": "プレビュー: Windows Server 2025 on AKS",
      "japaneseDescription": "Azure Kubernetes Service (AKS) で Windows ベースのワークロードを実行している組織は、古い Windows Server バージョンのサポート期間が終了するため、近代化する圧力に直面しています。顧客が準備するために、AKS では Windows Server 2025 のプレビュー サポートを提供しています。",
      "technicalTags": [
        "Azure Kubernetes Service",
        "Windows Server"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: AKS Automatic pod readiness SLA",
      "link": "https://azure.microsoft.com/updates?id=526208",
      "description": "Azure Kubernetes Service (AKS) Automatic\r\nclusters now come with a pod readiness SLA, guaranteeing that eligible pods meet\r\nreadiness criteria within five minutes at the 99.9th percentile.\r\nThis empowers customers to confidently deploy mission critical workl",
      "japaneseTitle": "一般提供: AKS 自動ポッドの準備性 SLA",
      "japaneseDescription": "Azure Kubernetes Service (AKS) の自動クラスターには、ポッドの準備性 SLA が含まれており、対象となるポッドが 5 分以内に準備性基準を満たすことを保証します (99.9 パーセントル)。これにより、顧客はミッションクリティカルなワークロードを自信を持ってデプロイできます。",
      "technicalTags": [
        "AKS",
        "Azure Kubernetes Service",
        "SLA"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: AKS Automatic managed system node pools",
      "link": "https://azure.microsoft.com/updates?id=526203",
      "description": "Provisioning and maintaining system node pools in AKS\r\nrequires ongoing effort to ensure proper scaling, patching, and availability, tasks\r\nthat can divert resources from application development and delivery.\r\nManaged system node pools in AKS Automatic remov",
      "japaneseTitle": "プレビュー: AKS 自動管理システム ノード プール",
      "japaneseDescription": "AKS でのシステム ノード プールのプロビジョニングとメンテナンスには、適切なスケーリング、パッチ適用、可用性を確保するために継続的な労力が必要であり、これらのタスクはアプリケーションの開発と配信からリソースをそらす可能性があります。AKS Automatic では、システム ノード プールを自動的に管理する機能が提供され、管理の負担を軽減し、アプリケーションの開発と配信に集中できるようになります。",
      "technicalTags": [
        "AKS",
        "Azure Kubernetes Service"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Add durability to AI agents in Azure Functions using Microsoft Agent Framework",
      "link": "https://azure.microsoft.com/updates?id=526179",
      "description": "You can now build and host reliable\r\nproduction-grade AI agents using the durable extension for\r\nMicrosoft Agent Framework. This integration combines the Microsoft Agent\r\nFramework with Azure Functions’ durable capabilities, delivering proven\r\norchestration a",
      "japaneseTitle": "プレビュー: Azure FunctionsでMicrosoft Agent Frameworkを使用してAIエージェントに耐久性を追加",
      "japaneseDescription": "Azure Functionsの耐久性拡張機能とMicrosoft Agent Frameworkを組み合わせて、信頼性の高いAIエージェントを構築およびホストできます。この統合により、実証済みのオーケストレーション機能が提供され、AIエージェントの開発と運用が容易になります。",
      "technicalTags": [
        "Azure Functions",
        "Microsoft Agent Framework"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Cross region pool association support for Azure Virtual Network Manager IP address management",
      "link": "https://azure.microsoft.com/updates?id=526174",
      "description": "Managing\r\nIP address spaces across multiple regions can be complex and error-prone.  With\r\nthis new capability, you can now associate a single IPAM pool with virtual\r\nnetworks in multiple regions, simplifying governance and ensuring\r\nconsistent CIDR allocatio",
      "japaneseTitle": "プレビュー: Azure Virtual Network Manager IP アドレス管理のクロスリージョン プール アソシエーション サポート",
      "japaneseDescription": "複数のリージョンにまたがる IP アドレス空間の管理は複雑でエラーが発生しやすいことがあります。この新しい機能により、単一の IPAM プールを複数のリージョンの仮想ネットワークにアソシエートできるようになり、ガバナンスが簡素化され、CIDR 割り当てが一貫性を持つようになります。",
      "technicalTags": [
        "Azure Virtual Network Manager",
        "IPAM"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Virtual Network Manager address overlap prevention in mesh",
      "link": "https://azure.microsoft.com/updates?id=526169",
      "description": "Azure Virtual Network Manager\r\naddress space overlap prevention in mesh is now generally available, bringing enhanced\r\nreliability and governance to multi-virtual network environments. Unintended\r\naddress overlap within mesh can lead to dropped traffic. This",
      "japaneseTitle": "一般提供開始: Azure Virtual Network Manager のメッシュ内のアドレス重複防止",
      "japaneseDescription": "Azure Virtual Network Manager のアドレス空間の重複防止機能が一般提供され、複数の仮想ネットワーク環境における信頼性とガバナンスが向上しました。メッシュ内での意図しないアドレスの重複は、トラフィックのドロップにつながる可能性があります。この機能により、複数の仮想ネットワーク間でのアドレスの重複を防止し、ネットワークの安定性を確保できます。",
      "technicalTags": [
        "Azure Virtual Network Manager"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Functions support for Node.js 24",
      "link": "https://azure.microsoft.com/updates?id=526077",
      "description": "You can now develop functions using Node.js 24 locally and deploy them\r\nto Azure Functions on Windows and Linux.   Note: Node.js 24 does not support\r\n32-bit systems on Windows. To ensure compatibility, new Windows Function Apps for\r\nNode.js 24 now default to",
      "japaneseTitle": "プレビュー: Azure Functions での Node.js 24 のサポート",
      "japaneseDescription": "Azure Functions で Node.js 24 を使用した関数の開発が可能になりました。ローカルで開発した関数を Windows と Linux の Azure Functions にデプロイできます。ただし、Node.js 24 は Windows の 32 ビット システムをサポートしていません。互換性を確保するために、新しい Windows Function Apps の Node.js 24 は既定で 64 ビット システムを使用します。",
      "technicalTags": [
        "Azure Functions",
        "Node.js"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Functions support for Java 25",
      "link": "https://azure.microsoft.com/updates?id=526072",
      "description": "You can now develop functions using Java\r\n25 locally and deploy them to Azure Functions on Windows and Linux.  Upgrade your apps to Java 25 to take\r\nadvantage of enhanced security, a longer support window, and continued\r\ncompatibility with the Azure Function",
      "japaneseTitle": "プレビュー: Azure Functions での Java 25 のサポート",
      "japaneseDescription": "Azure Functions で Java 25 を使用してローカルで関数を開発し、Windows と Linux にデプロイできるようになりました。アプリケーションを Java 25 にアップグレードして、セキュリティの強化、サポート期間の延長、および Azure Functions との互換性の継続を利用できます。",
      "technicalTags": [
        "Azure Functions",
        "Java 25",
        "Windows",
        "Linux"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Application Gateway for Containers – Slow start",
      "link": "https://azure.microsoft.com/updates?id=525893",
      "description": "Slow start is now\r\ngenerally available as a load balancing algorithm in Application Gateway for\r\nContainers. This feature improves stability and performance during backend\r\nscale-up by gradually increasing traffic to new pods over a configurable time\r\nwindow.",
      "japaneseTitle": "一般提供: コンテナーのApplication Gateway – スロースタート",
      "japaneseDescription": "スロースタートは、コンテナーのApplication Gatewayで一般提供されたロードバランシングアルゴリズムです。この機能は、バックエンドのスケールアップ中に、新しいポッドへのトラフィックを設定可能な時間枠内で徐々に増加させることで、安定性とパフォーマンスを向上させます。",
      "technicalTags": [
        "Application Gateway",
        "Containers"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Application Gateway for Containers Istio Service Mesh integration",
      "link": "https://azure.microsoft.com/updates?id=525874",
      "description": "Application\r\nGateway for Containers now supports integration with Istio service mesh through\r\nan optional service mesh extension. This feature simplifies secure north-south\r\ncommunication between external clients and services within the service mesh. Single",
      "japaneseTitle": "プレビュー: コンテナーのApplication GatewayとIstio Service Meshの統合",
      "japaneseDescription": "コンテナーのApplication Gatewayでは、オプションのサービス メッシュ拡張機能を介してIstioサービス メッシュとの統合がサポートされるようになりました。この機能により、外部クライアントとサービス メッシュ内のサービス間のセキュアな北南通信が簡素化されます。シングル",
      "technicalTags": [
        "Application Gateway",
        "Istio",
        "Service Mesh"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure DocumentDB high-performance storage",
      "link": "https://azure.microsoft.com/updates?id=525549",
      "description": "Now you can run bigger, faster workloads on fewer nodes using high-performance storage for Azure DocumentDB. This update delivers up to 64 TiB capacity, 80,000 IOPS, and 1,200 MB/s throughput per physical shard (node). Storage IOPS and throughput on Azure",
      "japaneseTitle": "プレビュー: Azure DocumentDB のハイパフォーマンスストレージ",
      "japaneseDescription": "Azure DocumentDB のハイパフォーマンスストレージを使用して、より大規模で高速なワークロードをより少ないノードで実行できます。この更新により、物理シャード (ノード) あたり最大 64 TiB の容量、80,000 IOPS、1,200 MB/秒のスループットが提供されます。Azure のストレージ IOPS とスループットが向上します。",
      "technicalTags": [
        "Azure DocumentDB",
        "IOPS",
        "TiB"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Model Context Protocol (MCP) tool trigger for Azure Functions",
      "link": "https://azure.microsoft.com/updates?id=525523",
      "description": "Model\r\nContext Protocol (MCP) is a way for apps to provide capabilities and context to\r\na large language model. A key feature of MCP is the ability to define tools\r\nthat AI agents can leverage to accomplish whatever tasks they’ve been given.\r\nMCP servers can",
      "japaneseTitle": "一般提供開始: Azure Functions 用 Model Context Protocol (MCP) ツール トリガー",
      "japaneseDescription": "Model Context Protocol (MCP) は、アプリケーションが大規模な言語モデルに機能とコンテキストを提供する方法です。MCP の重要な機能の 1 つは、AI エージェントが与えられたタスクを実行するために利用できるツールを定義する能力です。MCP サーバーは、Azure Functions などのプラットフォームと統合して、AI エージェントがより複雑なタスクを実行できるようにします。",
      "technicalTags": [
        "Model Context Protocol",
        "Azure Functions",
        "AI"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Functions durable task scheduler Dedicated SKU (GA) & Consumption SKU (Public Preview)",
      "link": "https://azure.microsoft.com/updates?id=525518",
      "description": "Earlier this year, we\r\nintroduced Azure Functions durable task scheduler, an orchestration engine\r\ndesigned for complex workflows and intelligent agents. It automatically\r\ncheckpoints progress and protects your orchestration state, enabling resilient\r\nand rel",
      "japaneseTitle": "一般提供開始: Azure Functions 耐久性タスク スケジューラー専用 SKU (GA) & 消費 SKU (パブリック プレビュー)",
      "japaneseDescription": "今年の初めに、複雑なワークフローとインテリジェント エージェント向けに設計されたオーケストレーション エンジンである Azure Functions 耐久性タスク スケジューラーを導入しました。この機能は、自動的に進行状況をチェックポイント化し、オーケストレーションの状態を保護することで、堅牢で信頼性の高い実行を可能にします。Azure Functions 耐久性タスク スケジューラーは、専用 SKU と消費 SKU の 2 つのオプションで提供されます。",
      "technicalTags": [
        "Azure Functions",
        "Durable Task Scheduler"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Self-hosted remote MCP servers on Azure Functions",
      "link": "https://azure.microsoft.com/updates?id=525505",
      "description": "We are introducing a new capability that allows you to host\r\nremote Model Context Protocol (MCP) servers built with the MCP SDKs on Functions. Some key benefits of hosting on the Functions platform include:  Built-in server authentication Automatic and bur",
      "japaneseTitle": "プレビュー: Azure Functions でのセルフホスト リモート MCP サーバー",
      "japaneseDescription": "Azure Functions で、MCP SDK を使用して構築されたリモート Model Context Protocol (MCP) サーバーをセルフホストできる新しい機能を導入します。Functions プラットフォームでのホストの主な利点には、組み込みのサーバー認証や自動バックアップなどがあります。",
      "technicalTags": [
        "Azure Functions",
        "MCP SDK",
        "Model Context Protocol"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Announcing: Resources for migrating to Azure Functions Flex Consumption",
      "link": "https://azure.microsoft.com/updates?id=525500",
      "description": "Azure Functions Flex Consumption is\r\nnow the recommended hosting plan for serverless workloads requiring advanced\r\nscaling, networking, and cost optimization. To support customers migrating from\r\nthe Azure Functions Consumption plan or from AWS Lambda, Micro",
      "japaneseTitle": "Azure Functions Flex Consumption への移行のためのリソースの発表",
      "japaneseDescription": "Azure Functions Flex Consumption は、サーバーレス ワークロードに高度なスケーリング、ネットワーキング、およびコスト最適化が必要な場合に推奨されるホスティング プランです。Azure Functions Consumption プランまたは AWS Lambda から移行する顧客をサポートするために、リソースが提供されています。",
      "technicalTags": [
        "Azure Functions",
        "AWS Lambda"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Functions enables OpenTelemetry support",
      "link": "https://azure.microsoft.com/updates?id=525479",
      "description": "Azure Functions now supports\r\nOpenTelemetry in general availability (GA), enabling developers to export logs,\r\ntraces, and metrics using open standards. This release builds on the public\r\npreview and delivers a production-ready observability experience for s",
      "japaneseTitle": "[Launched] Generally Available: Azure Functions enables OpenTelemetry support",
      "japaneseDescription": "Azure Functions now supports\r\nOpenTelemetry in general availability (GA), enabling developers to export logs,\r\ntraces, and metrics using open standards. This release builds on the public\r\npreview and delivers a production-ready observability experience for s",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Container Apps adds support for agentic Docker Compose",
      "link": "https://azure.microsoft.com/updates?id=525470",
      "description": "Azure Container Apps is bringing the familiar\r\ndeveloper workflow of Docker Compose directly to Azure Container Apps. As one\r\nof the most widely adopted tools among developers, Docker Compose simplifies\r\ndefining and running multi-container applications, and",
      "japaneseTitle": "[In preview] Public Preview: Azure Container Apps adds support for agentic Docker Compose",
      "japaneseDescription": "Azure Container Apps is bringing the familiar\r\ndeveloper workflow of Docker Compose directly to Azure Container Apps. As one\r\nof the most widely adopted tools among developers, Docker Compose simplifies\r\ndefining and running multi-container applications, and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Container Apps introduces flexible workload profile",
      "link": "https://azure.microsoft.com/updates?id=525465",
      "description": "Flexible workload profile represents a new option\r\nthat blends the simplicity of consumption with many of the performance and\r\ncontrol characteristics of dedicated workload profiles. This offers the same\r\neasy-to-understand, pay-per-use serverless model as C",
      "japaneseTitle": "[In preview] Public Preview: Azure Container Apps introduces flexible workload profile",
      "japaneseDescription": "Flexible workload profile represents a new option\r\nthat blends the simplicity of consumption with many of the performance and\r\ncontrol characteristics of dedicated workload profiles. This offers the same\r\neasy-to-understand, pay-per-use serverless model as C",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Container Apps serverless GPUs in additional regions",
      "link": "https://azure.microsoft.com/updates?id=525460",
      "description": "To meet growing demand for GPU-powered workloads, Azure\r\nContainer Apps serverless GPUs are\r\nnow generally available in additional regions. This expansion enables\r\ndevelopers to run AI inference, model training, and GPU-accelerated workloads\r\nwith the simplic",
      "japaneseTitle": "[Launched] Generally Available: Azure Container Apps serverless GPUs in additional regions",
      "japaneseDescription": "To meet growing demand for GPU-powered workloads, Azure\r\nContainer Apps serverless GPUs are\r\nnow generally available in additional regions. This expansion enables\r\ndevelopers to run AI inference, model training, and GPU-accelerated workloads\r\nwith the simplic",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Confidential computing in Azure Container Apps",
      "link": "https://azure.microsoft.com/updates?id=525455",
      "description": "Confidential\r\ncomputing support in Azure Container Apps is now in public preview. This\r\nrelease brings hardware-based Trusted Execution Environments (TEEs) to your\r\ncontainerized workloads. Azure already provides encryption of data at rest and\r\nin transit, an",
      "japaneseTitle": "[In preview] Public Preview: Confidential computing in Azure Container Apps",
      "japaneseDescription": "Confidential\r\ncomputing support in Azure Container Apps is now in public preview. This\r\nrelease brings hardware-based Trusted Execution Environments (TEEs) to your\r\ncontainerized workloads. Azure already provides encryption of data at rest and\r\nin transit, an",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Standard V2 NAT Gateway and StandardV2 Public IPs",
      "link": "https://azure.microsoft.com/updates?id=525405",
      "description": "StandardV2 SKU NAT Gateway is now in public preview, delivering next-generation capabilities for scalable and resilient outbound connectivity. New offerings: Zone-Redundancy: Built for high availability in availability zone supported regions. Traffic surv",
      "japaneseTitle": "[In preview] Public Preview: Standard V2 NAT Gateway and StandardV2 Public IPs",
      "japaneseDescription": "StandardV2 SKU NAT Gateway is now in public preview, delivering next-generation capabilities for scalable and resilient outbound connectivity. New offerings: Zone-Redundancy: Built for high availability in availability zone supported regions. Traffic surv",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: SQL database in Microsoft Fabric",
      "link": "https://azure.microsoft.com/updates?id=525388",
      "description": "SQL database in Fabric is now generally available. Built on the trusted SQL Server and Azure SQL Database engine, this fully SaaS-native solution empowers developers and data professionals to unify operational and analytical workloads with speed, security",
      "japaneseTitle": "[Launched] Generally Available: SQL database in Microsoft Fabric",
      "japaneseDescription": "SQL database in Fabric is now generally available. Built on the trusted SQL Server and Azure SQL Database engine, this fully SaaS-native solution empowers developers and data professionals to unify operational and analytical workloads with speed, security",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Support for Italian and Portuguese in Azure Cosmos DB for NoSQL full-text search",
      "link": "https://azure.microsoft.com/updates?id=523824",
      "description": "Azure Cosmos DB for NoSQL now supports Italian and Portuguese languages in full-text search, available today in public preview. This update adds to the list of supported languages, enabling you to build rich, language-aware search experiences that underst",
      "japaneseTitle": "[In preview] Public Preview: Support for Italian and Portuguese in Azure Cosmos DB for NoSQL full-text search",
      "japaneseDescription": "Azure Cosmos DB for NoSQL now supports Italian and Portuguese languages in full-text search, available today in public preview. This update adds to the list of supported languages, enabling you to build rich, language-aware search experiences that underst",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Cosmos DB MCP ToolKit for Microsoft Foundry Agent Service",
      "link": "https://azure.microsoft.com/updates?id=523814",
      "description": "Azure Cosmos DB for NoSQL now offers an MCP Toolkit that can be used with Microsoft Foundry  Agent Service, available today in public preview.  This new integration allows you to connect Microsoft Foundry Agents directly to data in Azure Cosmos DB. By dep",
      "japaneseTitle": "[In preview] Public Preview: Azure Cosmos DB MCP ToolKit for Microsoft Foundry Agent Service",
      "japaneseDescription": "Azure Cosmos DB for NoSQL now offers an MCP Toolkit that can be used with Microsoft Foundry  Agent Service, available today in public preview.  This new integration allows you to connect Microsoft Foundry Agents directly to data in Azure Cosmos DB. By dep",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Fuzzy search in Azure Cosmos DB for NoSQL full-text search",
      "link": "https://azure.microsoft.com/updates?id=523809",
      "description": "Azure Cosmos DB for NoSQL now supports fuzzy search in full-text search. With fuzzy search, you can deliver typo-tolerant, error-resilient search experiences directly within Azure Cosmos DB, helping your users find the right results even when queries or t",
      "japaneseTitle": "[Launched] Generally Available: Fuzzy search in Azure Cosmos DB for NoSQL full-text search",
      "japaneseDescription": "Azure Cosmos DB for NoSQL now supports fuzzy search in full-text search. With fuzzy search, you can deliver typo-tolerant, error-resilient search experiences directly within Azure Cosmos DB, helping your users find the right results even when queries or t",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Vector indexing performance improvements in Azure Cosmos DB for NoSQL",
      "link": "https://azure.microsoft.com/updates?id=523803",
      "description": "This release gives you faster vector inserts and index builds in Azure Cosmos DB for NoSQL, helping you reduce end-to-end ingestion and indexing times for large AI workloads. This improvement is powered by algorithmic enhancements to our vector indexing e",
      "japaneseTitle": "[Launched] Generally Available: Vector indexing performance improvements in Azure Cosmos DB for NoSQL",
      "japaneseDescription": "This release gives you faster vector inserts and index builds in Azure Cosmos DB for NoSQL, helping you reduce end-to-end ingestion and indexing times for large AI workloads. This improvement is powered by algorithmic enhancements to our vector indexing e",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Float16 data type for vector indexes in Azure Cosmos DB",
      "link": "https://azure.microsoft.com/updates?id=523796",
      "description": "Azure Cosmos DB now supports float 16 data types for vector indexes. With this update, you can store and query vectors using half-precision floating-point numbers. Using float16 cuts storage usage in half compared to float32, while maintaining high retrie",
      "japaneseTitle": "[Launched] Generally Available: Float16 data type for vector indexes in Azure Cosmos DB",
      "japaneseDescription": "Azure Cosmos DB now supports float 16 data types for vector indexes. With this update, you can store and query vectors using half-precision floating-point numbers. Using float16 cuts storage usage in half compared to float32, while maintaining high retrie",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Cosmos DB for Visual Studio Code",
      "link": "https://azure.microsoft.com/updates?id=523782",
      "description": "Developers today are building more intelligent, connected, and autonomous applications than ever before. From personalized chatbots and copilots to dynamic content engines and decision systems, data is the foundation of these agentic experiences.  Azure C",
      "japaneseTitle": "[Launched] Generally Available: Azure Cosmos DB for Visual Studio Code",
      "japaneseDescription": "Developers today are building more intelligent, connected, and autonomous applications than ever before. From personalized chatbots and copilots to dynamic content engines and decision systems, data is the foundation of these agentic experiences.  Azure C",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Cosmos DB Mirroring in Microsoft Fabric",
      "link": "https://azure.microsoft.com/updates?id=523773",
      "description": "Now generally available, Azure Cosmos DB Mirroring in Fabric enables you to seamlessly integrate your existing operational workloads with the analytical capabilities of Microsoft Fabric. You can take advantage of the innovations in Fabric, running SQL que",
      "japaneseTitle": "[Launched] Generally Available: Azure Cosmos DB Mirroring in Microsoft Fabric",
      "japaneseDescription": "Now generally available, Azure Cosmos DB Mirroring in Fabric enables you to seamlessly integrate your existing operational workloads with the analytical capabilities of Microsoft Fabric. You can take advantage of the innovations in Fabric, running SQL que",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Cosmos DB in Microsoft Fabric",
      "link": "https://azure.microsoft.com/updates?id=523768",
      "description": "Now generally available, Cosmos DB in Fabric enables you to build operational and analytical workloads in Microsoft Fabric. You can use the AI-features in Azure Cosmos DB plus the innovations in Fabric to run SQL queries over JSON data and build real-time",
      "japaneseTitle": "[Launched] Generally Available: Cosmos DB in Microsoft Fabric",
      "japaneseDescription": "Now generally available, Cosmos DB in Fabric enables you to build operational and analytical workloads in Microsoft Fabric. You can use the AI-features in Azure Cosmos DB plus the innovations in Fabric to run SQL queries over JSON data and build real-time",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Index Advisor for Azure DocumentDB",
      "link": "https://azure.microsoft.com/updates?id=523763",
      "description": "Integrated into the DocumentDB for VS Code extension, the Index Advisor enables you to view and debug database performance. It uses natural language to recommend optimal indexing and best practices for your MongoDB workloads.  Learn more.",
      "japaneseTitle": "[In preview] Public Preview: Index Advisor for Azure DocumentDB",
      "japaneseDescription": "Integrated into the DocumentDB for VS Code extension, the Index Advisor enables you to view and debug database performance. It uses natural language to recommend optimal indexing and best practices for your MongoDB workloads.  Learn more.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Priority-based execution in Azure Cosmos DB",
      "link": "https://azure.microsoft.com/updates?id=523754",
      "description": "You can now enable priority-based execution in Azure Cosmos DB to ensure that high-priority requests are favored during periods of contention. The system will throttle low-priority requests first, allowing high-priority operations to proceed on a best-eff",
      "japaneseTitle": "[Launched] Generally Available: Priority-based execution in Azure Cosmos DB",
      "japaneseDescription": "You can now enable priority-based execution in Azure Cosmos DB to ensure that high-priority requests are favored during periods of contention. The system will throttle low-priority requests first, allowing high-priority operations to proceed on a best-eff",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Cosmos DB Fleet Analytics",
      "link": "https://azure.microsoft.com/updates?id=523745",
      "description": "You can now unify insights across your entire Azure Cosmos DB footprint using Azure Cosmos DB Fleet Analytics, available in public preview. Fleet Analytics helps you manage data across multiple accounts, subscriptions, and workloads, providing large-scale",
      "japaneseTitle": "[In preview] Public Preview: Azure Cosmos DB Fleet Analytics",
      "japaneseDescription": "You can now unify insights across your entire Azure Cosmos DB footprint using Azure Cosmos DB Fleet Analytics, available in public preview. Fleet Analytics helps you manage data across multiple accounts, subscriptions, and workloads, providing large-scale",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Cosmos DB fleet pools",
      "link": "https://azure.microsoft.com/updates?id=523740",
      "description": "Now you can more easily operate your Azure Cosmos DB accounts at scale. Azure Cosmos DB fleet pools give you new capabilities when building multitenant software as a service (SaaS) applications.  You can simplify capacity management by creating a pool of",
      "japaneseTitle": "[Launched] Generally Available: Azure Cosmos DB fleet pools",
      "japaneseDescription": "Now you can more easily operate your Azure Cosmos DB accounts at scale. Azure Cosmos DB fleet pools give you new capabilities when building multitenant software as a service (SaaS) applications.  You can simplify capacity management by creating a pool of",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure DocumentDB - an open-source, MongoDB-compatible document database service for hybrid and multicloud",
      "link": "https://azure.microsoft.com/updates?id=523735",
      "description": "Microsoft is announcing the general availability of Azure DocumentDB, a fully managed document database service built on the open-source, MongoDB-compatible DocumentDB, now governed by the Linux Foundation. Formerly known as Azure Cosmos DB for MongoDB (v",
      "japaneseTitle": "[Launched] Generally Available: Azure DocumentDB - an open-source, MongoDB-compatible document database service for hybrid and multicloud",
      "japaneseDescription": "Microsoft is announcing the general availability of Azure DocumentDB, a fully managed document database service built on the open-source, MongoDB-compatible DocumentDB, now governed by the Linux Foundation. Formerly known as Azure Cosmos DB for MongoDB (v",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Dynamic data masking with Azure Cosmos DB",
      "link": "https://azure.microsoft.com/updates?id=523726",
      "description": "You can now help protect sensitive data from unauthorized access using dynamic data masking (DDM), a server-side, policy-based security feature in Azure Cosmos DB. DDM dynamically masks data for non-privileged users, ensuring that sensitive information is",
      "japaneseTitle": "[In preview] Public Preview: Dynamic data masking with Azure Cosmos DB",
      "japaneseDescription": "You can now help protect sensitive data from unauthorized access using dynamic data masking (DDM), a server-side, policy-based security feature in Azure Cosmos DB. DDM dynamically masks data for non-privileged users, ensuring that sensitive information is",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Online and offline migrations in Azure DocumentDB Migration extension",
      "link": "https://azure.microsoft.com/updates?id=523721",
      "description": "You can now migrate MongoDB workloads to Azure DocumentDB using the new Azure DocumentDB Migration extension for Visual Studio Code—now available in public preview. This seamless, zero-cost migration supports both online and offline modes, simplifying and",
      "japaneseTitle": "[In preview] Public Preview: Online and offline migrations in Azure DocumentDB Migration extension",
      "japaneseDescription": "You can now migrate MongoDB workloads to Azure DocumentDB using the new Azure DocumentDB Migration extension for Visual Studio Code—now available in public preview. This seamless, zero-cost migration supports both online and offline modes, simplifying and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Online migration from Azure Cosmos DB for MongoDB RU to Azure DocumentDB",
      "link": "https://azure.microsoft.com/updates?id=523716",
      "description": "Announcing the general availability of seamless, self-serve online migrations from Azure Cosmos DB for MongoDB RU to Azure DocumentDB—directly from the Azure portal. With this release, your organization can modernize its MongoDB workloads with zero downti",
      "japaneseTitle": "[Launched] Generally Available: Online migration from Azure Cosmos DB for MongoDB RU to Azure DocumentDB",
      "japaneseDescription": "Announcing the general availability of seamless, self-serve online migrations from Azure Cosmos DB for MongoDB RU to Azure DocumentDB—directly from the Azure portal. With this release, your organization can modernize its MongoDB workloads with zero downti",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Oracle to PostgreSQL migration tooling in Visual Studio Code",
      "link": "https://azure.microsoft.com/updates?id=523593",
      "description": "Migrating from Oracle to PostgreSQL is now simpler and faster with the new Oracle-to-PostgreSQL migration tooling, available directly in the Azure Database for PostgreSQL extension for Visual Studio Code.  This new tool helps you seamlessly convert your O",
      "japaneseTitle": "[In preview] Public Preview: Oracle to PostgreSQL migration tooling in Visual Studio Code",
      "japaneseDescription": "Migrating from Oracle to PostgreSQL is now simpler and faster with the new Oracle-to-PostgreSQL migration tooling, available directly in the Azure Database for PostgreSQL extension for Visual Studio Code.  This new tool helps you seamlessly convert your O",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: 2025 REST API for Azure Database for PostgreSQL",
      "link": "https://azure.microsoft.com/updates?id=523588",
      "description": "Announcing the general availability of the 2025 REST API for Azure Database for PostgreSQL. This release adds support for PostgreSQL 17 and 18, so you can adopt new versions without changing your automation patterns. You can also now set the default datab",
      "japaneseTitle": "[Launched] Generally Available: 2025 REST API for Azure Database for PostgreSQL",
      "japaneseDescription": "Announcing the general availability of the 2025 REST API for Azure Database for PostgreSQL. This release adds support for PostgreSQL 17 and 18, so you can adopt new versions without changing your automation patterns. You can also now set the default datab",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Elastic clusters on Azure Database for PostgreSQL – Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=523583",
      "description": "Now you can use elastic clusters to horizontally scale Azure Database for PostgreSQL through row-based and schema-based sharding. Elastic clusters make it easy to build multitenant apps by offloading shard management and operations—such as tenant isolatio",
      "japaneseTitle": "[Launched] Generally Available: Elastic clusters on Azure Database for PostgreSQL – Flexible Server",
      "japaneseDescription": "Now you can use elastic clusters to horizontally scale Azure Database for PostgreSQL through row-based and schema-based sharding. Elastic clusters make it easy to build multitenant apps by offloading shard management and operations—such as tenant isolatio",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Native Microsoft Foundry support for Azure Database for PostgreSQL",
      "link": "https://azure.microsoft.com/updates?id=523578",
      "description": "Announcing the public preview of Microsoft Foundry support for Azure Database for PostgreSQL. The Azure PostgreSQL MCP Server is now natively integrated with Microsoft Foundry.  This integration enables you to build AI agents to securely query and analyze",
      "japaneseTitle": "[In preview] Public Preview: Native Microsoft Foundry support for Azure Database for PostgreSQL",
      "japaneseDescription": "Announcing the public preview of Microsoft Foundry support for Azure Database for PostgreSQL. The Azure PostgreSQL MCP Server is now natively integrated with Microsoft Foundry.  This integration enables you to build AI agents to securely query and analyze",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Database for PostgreSQL – Flexible Server anon extension",
      "link": "https://azure.microsoft.com/updates?id=523569",
      "description": "The anon extension is now generally available in Azure Database for PostgreSQL flexible server. This extension provides data anonymization tools. Learn more.",
      "japaneseTitle": "[Launched] Generally Available: Azure Database for PostgreSQL – Flexible Server anon extension",
      "japaneseDescription": "The anon extension is now generally available in Azure Database for PostgreSQL flexible server. This extension provides data anonymization tools. Learn more.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Public Preview: Azure Database for PostgreSQL – Flexible Server v6 series VMs and AMD v6 Confidential Compute",
      "link": "https://azure.microsoft.com/updates?id=523564",
      "description": "Now you can deploy general purpose and memory-optimized v6-series Azure Virtual Machines with local NVMe storage in Azure Database for PostgreSQL flexible server. The v6 series is available with either Intel or AMD processor options. Learn more.",
      "japaneseTitle": "[Launched] Public Preview: Azure Database for PostgreSQL – Flexible Server v6 series VMs and AMD v6 Confidential Compute",
      "japaneseDescription": "Now you can deploy general purpose and memory-optimized v6-series Azure Virtual Machines with local NVMe storage in Azure Database for PostgreSQL flexible server. The v6 series is available with either Intel or AMD processor options. Learn more.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Database for PostgreSQL – Flexible Server pg_duckdb extension",
      "link": "https://azure.microsoft.com/updates?id=523559",
      "description": "Now you can create pg_duckdb extensions in Azure Database for PostgreSQL flexible server, so you can accelerate analytics using DuckDB’s vectorized, columnar execution.  Learn more.",
      "japaneseTitle": "[In preview] Public Preview: Azure Database for PostgreSQL – Flexible Server pg_duckdb extension",
      "japaneseDescription": "Now you can create pg_duckdb extensions in Azure Database for PostgreSQL flexible server, so you can accelerate analytics using DuckDB’s vectorized, columnar execution.  Learn more.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure SQL change event streaming",
      "link": "https://azure.microsoft.com/updates?id=523533",
      "description": "You can now stream data changes in near real time from Azure SQL Database directly into Azure Event Hubs. With the public preview of change event streaming (CES), you can streamline data integration and support enhanced analytics, event-driven architectur",
      "japaneseTitle": "[In preview] Public Preview: Azure SQL change event streaming",
      "japaneseDescription": "You can now stream data changes in near real time from Azure SQL Database directly into Azure Event Hubs. With the public preview of change event streaming (CES), you can streamline data integration and support enhanced analytics, event-driven architectur",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: PostgreSQL 18 with in-place upgrade on Azure Database for PostgreSQL",
      "link": "https://azure.microsoft.com/updates?id=523196",
      "description": "You can now use PostgreSQL 18 on Azure Database for PostgreSQL. This release introduces the latest PostgreSQL innovations along with seamless in-place upgrade support, allowing you to move from earlier versions without changing your server endpoint, recon",
      "japaneseTitle": "[Launched] Generally Available: PostgreSQL 18 with in-place upgrade on Azure Database for PostgreSQL",
      "japaneseDescription": "You can now use PostgreSQL 18 on Azure Database for PostgreSQL. This release introduces the latest PostgreSQL innovations along with seamless in-place upgrade support, allowing you to move from earlier versions without changing your server endpoint, recon",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: PostgreSQL extension for Visual Studio Code with GitHub Copilot",
      "link": "https://azure.microsoft.com/updates?id=523187",
      "description": "Announcing that the PostgreSQL extension for Visual Studio Code is generally available. With this powerful tool, you can connect to PostgreSQL database instances, run queries, create and manage connection profiles, and take advantage of Microsoft Entra ID",
      "japaneseTitle": "[Launched] Generally Available: PostgreSQL extension for Visual Studio Code with GitHub Copilot",
      "japaneseDescription": "Announcing that the PostgreSQL extension for Visual Studio Code is generally available. With this powerful tool, you can connect to PostgreSQL database instances, run queries, create and manage connection profiles, and take advantage of Microsoft Entra ID",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Mirroring in Fabric for PostgreSQL Flexible Server",
      "link": "https://azure.microsoft.com/updates?id=523177",
      "description": "You can now bring data together and simplify analytics using Microsoft Fabric mirroring for Azure Database for PostgreSQL flexible server, now generally available. Mirroring in Fabric unifies your organizational data in OneLake and supports network-isolat",
      "japaneseTitle": "[Launched] Generally Available: Mirroring in Fabric for PostgreSQL Flexible Server",
      "japaneseDescription": "You can now bring data together and simplify analytics using Microsoft Fabric mirroring for Azure Database for PostgreSQL flexible server, now generally available. Mirroring in Fabric unifies your organizational data in OneLake and supports network-isolat",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Database for PostgreSQL storage extension support for Parquet",
      "link": "https://azure.microsoft.com/updates?id=523167",
      "description": "Announcing that Azure Database for PostgreSQL flexible server now supports the Azure Storage extension with Parquet format and multiple compression options. You can seamlessly read and write Parquet files directly from your database, enabling faster data",
      "japaneseTitle": "[Launched] Generally Available: Azure Database for PostgreSQL storage extension support for Parquet",
      "japaneseDescription": "Announcing that Azure Database for PostgreSQL flexible server now supports the Azure Storage extension with Parquet format and multiple compression options. You can seamlessly read and write Parquet files directly from your database, enabling faster data",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure SQL Managed Instance Next-gen General Purpose service tier",
      "link": "https://azure.microsoft.com/updates?id=523125",
      "description": "The Next‑gen General Purpose tier delivers a major performance boost while preserving the cost advantages you expect. You get more power and compute flexibility without sacrificing the simplicity of a fully managed platform as a service (PaaS) experience.",
      "japaneseTitle": "[Launched] Generally Available: Azure SQL Managed Instance Next-gen General Purpose service tier",
      "japaneseDescription": "The Next‑gen General Purpose tier delivers a major performance boost while preserving the cost advantages you expect. You get more power and compute flexibility without sacrificing the simplicity of a fully managed platform as a service (PaaS) experience.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure SQL Database DiskANN vector indexing",
      "link": "https://azure.microsoft.com/updates?id=523110",
      "description": "Announcing the public preview of vector indexing using DiskANN in Azure SQL Database, Azure SQL Managed Instance and SQL database in Microsoft Fabric. DiskANN is an algorithm for efficient vector similarity search, making it ideal for product recommendati",
      "japaneseTitle": "[In preview] Public Preview: Azure SQL Database DiskANN vector indexing",
      "japaneseDescription": "Announcing the public preview of vector indexing using DiskANN in Azure SQL Database, Azure SQL Managed Instance and SQL database in Microsoft Fabric. DiskANN is an algorithm for efficient vector similarity search, making it ideal for product recommendati",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Generally Available: MSSQL extension integration with GitHub Copilot in Visual Studio Code",
      "link": "https://azure.microsoft.com/updates?id=523105",
      "description": "The MSSQL extension for Visual Studio Code now integrates GitHub Copilot, bringing AI-powered SQL assistance directly into your development workflow. Together, they help you reduce repetitive tasks, accelerate development, and design database schemas and",
      "japaneseTitle": "[In preview] Generally Available: MSSQL extension integration with GitHub Copilot in Visual Studio Code",
      "japaneseDescription": "The MSSQL extension for Visual Studio Code now integrates GitHub Copilot, bringing AI-powered SQL assistance directly into your development workflow. Together, they help you reduce repetitive tasks, accelerate development, and design database schemas and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure SQL Database long-term retention (LTR) backup immutability",
      "link": "https://azure.microsoft.com/updates?id=523095",
      "description": "You can now configure immutability for Azure SQL Database LTR backups to meet compliance and regulatory needs. Once immutability is configured, the backups can’t be edited or deleted until the specified retention expires, mitigating any potential ransomwa",
      "japaneseTitle": "[Launched] Generally Available: Azure SQL Database long-term retention (LTR) backup immutability",
      "japaneseDescription": "You can now configure immutability for Azure SQL Database LTR backups to meet compliance and regulatory needs. Once immutability is configured, the backups can’t be edited or deleted until the specified retention expires, mitigating any potential ransomwa",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: SQL Server Management Studio (SSMS) 22",
      "link": "https://azure.microsoft.com/updates?id=522586",
      "description": "SQL Server Management Studio (SSMS) has long been the trusted tool for managing SQL databases, writing T-SQL, and troubleshooting issues. With SSMS 22, built on Visual Studio 2026, you get support for SQL Server 2025, improved integration with SQL databas",
      "japaneseTitle": "[Launched] Generally Available: SQL Server Management Studio (SSMS) 22",
      "japaneseDescription": "SQL Server Management Studio (SSMS) has long been the trusted tool for managing SQL databases, writing T-SQL, and troubleshooting issues. With SSMS 22, built on Visual Studio 2026, you get support for SQL Server 2025, improved integration with SQL databas",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Microsoft Python driver for SQL Server",
      "link": "https://azure.microsoft.com/updates?id=522581",
      "description": "Announcing that the mssql-python driver is now generally available. This milestone marks a major step forward in delivering a modern, high-performance, and developer-friendly experience for Python developers working with SQL Server, Azure SQL Database, an",
      "japaneseTitle": "[Launched] Generally Available: Microsoft Python driver for SQL Server",
      "japaneseDescription": "Announcing that the mssql-python driver is now generally available. This milestone marks a major step forward in delivering a modern, high-performance, and developer-friendly experience for Python developers working with SQL Server, Azure SQL Database, an",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: New SQL Server migration in Azure Arc",
      "link": "https://azure.microsoft.com/updates?id=522572",
      "description": "A new SQL Server migration in Azure Arc solution streamlines and accelerates your journey to Azure SQL Managed Instance. Powered by Azure Database Migration Service and assisted by Copilot, it delivers an automated, end-to-end migration process that inclu",
      "japaneseTitle": "[Launched] Generally Available: New SQL Server migration in Azure Arc",
      "japaneseDescription": "A new SQL Server migration in Azure Arc solution streamlines and accelerates your journey to Azure SQL Managed Instance. Powered by Azure Database Migration Service and assisted by Copilot, it delivers an automated, end-to-end migration process that inclu",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Availabe: SQL Server 2025",
      "link": "https://azure.microsoft.com/updates?id=522559",
      "description": "SQL Server 2025, the AI-ready enterprise database, is now generally available, marking a major milestone in Microsoft’s mission to modernize enterprise data platforms. This release introduces built-in AI capabilities, seamless integration with Microsoft F",
      "japaneseTitle": "[Launched] Generally Availabe: SQL Server 2025",
      "japaneseDescription": "SQL Server 2025, the AI-ready enterprise database, is now generally available, marking a major milestone in Microsoft’s mission to modernize enterprise data platforms. This release introduces built-in AI capabilities, seamless integration with Microsoft F",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure SQL updates for November 2025",
      "link": "https://azure.microsoft.com/updates?id=522523",
      "description": "In November 2025, the following updates and enhancements were made to Azure SQL:  Apply the reservation discount for a 1-year or 3-year reservation of a zone-redundant Azure SQL Managed Instance in the General Purpose tier to both the standard compute and",
      "japaneseTitle": "[Launched] Generally Available: Azure SQL updates for November 2025",
      "japaneseDescription": "In November 2025, the following updates and enhancements were made to Azure SQL:  Apply the reservation discount for a 1-year or 3-year reservation of a zone-redundant Azure SQL Managed Instance in the General Purpose tier to both the standard compute and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure SQL updates for November 2025",
      "link": "https://azure.microsoft.com/updates?id=522514",
      "description": "In November 2025, the following updates and enhancements were made to Azure SQL: View, modify, insert rows in a table without manually writing T-SQL code using the interactive Edit Data interface in the MSSQL extension for Visual Studio Code. Learn more.",
      "japaneseTitle": "[In preview] Public Preview: Azure SQL updates for November 2025",
      "japaneseDescription": "In November 2025, the following updates and enhancements were made to Azure SQL: View, modify, insert rows in a table without manually writing T-SQL code using the interactive Edit Data interface in the MSSQL extension for Visual Studio Code. Learn more.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Dynamic sessions shell environment and MCP support in Azure Container Apps",
      "link": "https://azure.microsoft.com/updates?id=512949",
      "description": "Azure Container Apps now supports dynamic shell sessions in public\r\npreview. A shell session is a platform-managed built-in container used to\r\nrun and execute common shell commands in an isolated sandboxed\r\nenvironment.  With Azure Container Apps dynamic ses",
      "japaneseTitle": "[In preview] Public Preview: Dynamic sessions shell environment and MCP support in Azure Container Apps",
      "japaneseDescription": "Azure Container Apps now supports dynamic shell sessions in public\r\npreview. A shell session is a platform-managed built-in container used to\r\nrun and execute common shell commands in an isolated sandboxed\r\nenvironment.  With Azure Container Apps dynamic ses",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Deployment labels in Azure Container Apps",
      "link": "https://azure.microsoft.com/updates?id=512900",
      "description": "Azure\r\nContainer Apps now supports deployment labels in public preview as a new\r\ndeployment mode. This feature simplifies environment management and enables\r\nadvanced deployment strategies for your applications by allowing you to assign\r\nmeaningful names—such",
      "japaneseTitle": "[In preview] Public Preview: Deployment labels in Azure Container Apps",
      "japaneseDescription": "Azure\r\nContainer Apps now supports deployment labels in public preview as a new\r\ndeployment mode. This feature simplifies environment management and enables\r\nadvanced deployment strategies for your applications by allowing you to assign\r\nmeaningful names—such",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Rule-based routing in Azure Container Apps",
      "link": "https://azure.microsoft.com/updates?id=512850",
      "description": "Azure Container Apps support for rule-based routing is now\r\ngenerally available. This feature provides greater flexibility and\r\ncomposability to your Azure Container Apps by simplifying your architecture for\r\nmicroservice applications, A/B testing, blue-gree",
      "japaneseTitle": "[Launched] Generally Available: Rule-based routing in Azure Container Apps",
      "japaneseDescription": "Azure Container Apps support for rule-based routing is now\r\ngenerally available. This feature provides greater flexibility and\r\ncomposability to your Azure Container Apps by simplifying your architecture for\r\nmicroservice applications, A/B testing, blue-gree",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Premium Ingress in Azure Container Apps",
      "link": "https://azure.microsoft.com/updates?id=512813",
      "description": "Azure\r\nContainer Apps support for premium ingress is now generally available. This\r\nfeature introduces environment-level ingress configuration options, with the\r\nprimary highlight being customizable ingress scaling. This capability supports\r\nthe scaling of th",
      "japaneseTitle": "[Launched] Generally Available: Premium Ingress in Azure Container Apps",
      "japaneseDescription": "Azure\r\nContainer Apps support for premium ingress is now generally available. This\r\nfeature introduces environment-level ingress configuration options, with the\r\nprimary highlight being customizable ingress scaling. This capability supports\r\nthe scaling of th",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: JWT Validation in Azure Application Gateway",
      "link": "https://azure.microsoft.com/updates?id=489855",
      "description": "Announcing the preview of JSON Web Token (JWT) validation in Azure Application Gateway — enabling authentication and token validation right at the Application gateway before traffic reaches your backend applications or APIs.Why It mattersProtect at the pe",
      "japaneseTitle": "[In preview] Public Preview: JWT Validation in Azure Application Gateway",
      "japaneseDescription": "Announcing the preview of JSON Web Token (JWT) validation in Azure Application Gateway — enabling authentication and token validation right at the Application gateway before traffic reaches your backend applications or APIs.Why It mattersProtect at the pe",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[Launched] Generally Available: Azure Application Gateway mTLS passthrough support",
      "link": "https://azure.microsoft.com/updates?id=488990",
      "description": "Announcing a new mTLS enhancement in Azure Application Gateway for backend applications that perform client certificate and authorization header validation at the backend while still requiring web traffic inspection through the Web Application Firewall (W",
      "japaneseTitle": "[Launched] Generally Available: Azure Application Gateway mTLS passthrough support",
      "japaneseDescription": "Announcing a new mTLS enhancement in Azure Application Gateway for backend applications that perform client certificate and authorization header validation at the backend while still requiring web traffic inspection through the Web Application Firewall (W",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T17:01:02.000Z"
    },
    {
      "title": "[In preview] Public Preview: Azure Copilot observability agent",
      "link": "https://azure.microsoft.com/updates?id=528538",
      "description": "Cloud operations need more than reactive troubleshooting, they demand intelligent observability that scales across resources and delivers actionable insights when services aren’t performing as expected.Introducing the Azure Copilot observability agent tha",
      "japaneseTitle": "[In preview] Public Preview: Azure Copilot observability agent",
      "japaneseDescription": "Cloud operations need more than reactive troubleshooting, they demand intelligent observability that scales across resources and delivers actionable insights when services aren’t performing as expected.Introducing the Azure Copilot observability agent tha",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:30:36.000Z"
    },
    {
      "title": "[In development] Private Preview: ActiveMQ and JMS connector for Azure Logic Apps",
      "link": "https://azure.microsoft.com/updates?id=531783",
      "description": "Announcing private preview of Active MQ/JMS connector in Azure Logic Apps. With this capability, you can now connect to enterprise messaging systems built on ActiveMQ and JMS for advanced hybrid integration scenarios.",
      "japaneseTitle": "[In development] Private Preview: ActiveMQ and JMS connector for Azure Logic Apps",
      "japaneseDescription": "Announcing private preview of Active MQ/JMS connector in Azure Logic Apps. With this capability, you can now connect to enterprise messaging systems built on ActiveMQ and JMS for advanced hybrid integration scenarios.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: New healthcare connectors for Azure Logic Apps",
      "link": "https://azure.microsoft.com/updates?id=531778",
      "description": "Announcing new capabilities in Azure Logic Apps that expand healthcare interoperability support through a rich set of connectors. The following connectors are now in public preview: HL7 connector: Enable seamless healthcare data exchange using HL7 messagi",
      "japaneseTitle": "[In preview] Public Preview: New healthcare connectors for Azure Logic Apps",
      "japaneseDescription": "Announcing new capabilities in Azure Logic Apps that expand healthcare interoperability support through a rich set of connectors. The following connectors are now in public preview: HL7 connector: Enable seamless healthcare data exchange using HL7 messagi",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Scheduled Actions",
      "link": "https://azure.microsoft.com/updates?id=530797",
      "description": "Schedule Actions gives the ability to manage the lifecycle of VMs at high scale on a periodic basis. Subscription throttling and retries due to transient errors are handled automatically to ensure that your operations succeed without additional overhead.W",
      "japaneseTitle": "[Launched] Generally Available: Scheduled Actions",
      "japaneseDescription": "Schedule Actions gives the ability to manage the lifecycle of VMs at high scale on a periodic basis. Subscription throttling and retries due to transient errors are handled automatically to ensure that your operations succeed without additional overhead.W",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Microsoft Marketplace",
      "link": "https://azure.microsoft.com/updates?id=530614",
      "description": "Microsoft Marketplace — your trusted source for cloud solutions, AI apps, and agents — is now globally available following its launch in the United States in September. All traffic from legacy storefronts (Azure Marketplace and AppSource) is now redirecte",
      "japaneseTitle": "[Launched] Generally Available: Microsoft Marketplace",
      "japaneseDescription": "Microsoft Marketplace — your trusted source for cloud solutions, AI apps, and agents — is now globally available following its launch in the United States in September. All traffic from legacy storefronts (Azure Marketplace and AppSource) is now redirecte",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Resale enabled offers through Microsoft Marketplace",
      "link": "https://azure.microsoft.com/updates?id=530593",
      "description": "To help commercial customers maximize their technology innovation with Azure, Microsoft Marketplace is fully embracing the channel-led Marketplace opportunity with the general availability of resale enabled offers.  Resale enabled offers enable software c",
      "japaneseTitle": "[Launched] Generally Available: Resale enabled offers through Microsoft Marketplace",
      "japaneseDescription": "To help commercial customers maximize their technology innovation with Azure, Microsoft Marketplace is fully embracing the channel-led Marketplace opportunity with the general availability of resale enabled offers.  Resale enabled offers enable software c",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: GitHub Copilot app modernization expanded capabilities",
      "link": "https://azure.microsoft.com/updates?id=530257",
      "description": "Announcing new enhancements to GitHub Copilot App\r\nModernization that are in Public Preview, making it easier than ever to modernize applications,\r\ndatabases, containers, and accelerate migration to Azure. Below are the new\r\ncapabilities in public preview.",
      "japaneseTitle": "[In preview] Public Preview: GitHub Copilot app modernization expanded capabilities",
      "japaneseDescription": "Announcing new enhancements to GitHub Copilot App\r\nModernization that are in Public Preview, making it easier than ever to modernize applications,\r\ndatabases, containers, and accelerate migration to Azure. Below are the new\r\ncapabilities in public preview.",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Industry-leading storage performance Ebsv6 VM series",
      "link": "https://azure.microsoft.com/updates?id=529416",
      "description": "Announcing the public preview of the new Azure Ebsv6 VM series, powered by 5th Generation Intel® Xeon® processors. The Ebsv6 and Ebdsv6 VMs deliver up to and industry leading 800,000 IOPS and 14 GBps of remote disk storage throughput, providing high-perfo",
      "japaneseTitle": "[In preview] Public Preview: Industry-leading storage performance Ebsv6 VM series",
      "japaneseDescription": "Announcing the public preview of the new Azure Ebsv6 VM series, powered by 5th Generation Intel® Xeon® processors. The Ebsv6 and Ebdsv6 VMs deliver up to and industry leading 800,000 IOPS and 14 GBps of remote disk storage throughput, providing high-perfo",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In development] Public Preview: User and group quota reports in Azure NetApp Files",
      "link": "https://azure.microsoft.com/updates?id=528899",
      "description": "For organizations leveraging individual user and group quotas in Azure NetApp Files to manage capacity on NFS, SMB, and dual-protocol volumes, the user and group quota reporting feature offers clear visibility into key metrics such as quota limits, used c",
      "japaneseTitle": "[In development] Public Preview: User and group quota reports in Azure NetApp Files",
      "japaneseDescription": "For organizations leveraging individual user and group quotas in Azure NetApp Files to manage capacity on NFS, SMB, and dual-protocol volumes, the user and group quota reporting feature offers clear visibility into key metrics such as quota limits, used c",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: New Hybrid Integration Connectors for Azure Logic Apps",
      "link": "https://azure.microsoft.com/updates?id=527683",
      "description": "Announcing new capabilities in Azure Logic\r\nApps that expand hybrid integration through a rich set of connectors. The following connectors are now generally available: Confluent Kafka connector: Connect Logic Apps to\r\nConfluent Cloud for event streaming and",
      "japaneseTitle": "[Launched] Generally Available: New Hybrid Integration Connectors for Azure Logic Apps",
      "japaneseDescription": "Announcing new capabilities in Azure Logic\r\nApps that expand hybrid integration through a rich set of connectors. The following connectors are now generally available: Confluent Kafka connector: Connect Logic Apps to\r\nConfluent Cloud for event streaming and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Redesigned designer experience for Azure Logic Apps [Standard]",
      "link": "https://azure.microsoft.com/updates?id=527673",
      "description": "Announcing the public preview of the\r\nredesigned designer experience for Azure Logic Apps (Standard), a major update\r\nthat makes building, editing, and managing workflows faster and more intuitive. The new designer brings run history and workflow editing\r\ncl",
      "japaneseTitle": "[In preview] Public Preview: Redesigned designer experience for Azure Logic Apps [Standard]",
      "japaneseDescription": "Announcing the public preview of the\r\nredesigned designer experience for Azure Logic Apps (Standard), a major update\r\nthat makes building, editing, and managing workflows faster and more intuitive. The new designer brings run history and workflow editing\r\ncl",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: New Agent Loop capabilities in Azure Logic Apps",
      "link": "https://azure.microsoft.com/updates?id=527663",
      "description": "Announcing a new set of capabilities for\r\nAgent Loop in Azure Logic Apps, now in public preview. These updates expand how\r\norganizations can build, secure, and deploy agentic workflows across their\r\nenterprise environments enabling more flexible AI orchestra",
      "japaneseTitle": "[In preview] Public Preview: New Agent Loop capabilities in Azure Logic Apps",
      "japaneseDescription": "Announcing a new set of capabilities for\r\nAgent Loop in Azure Logic Apps, now in public preview. These updates expand how\r\norganizations can build, secure, and deploy agentic workflows across their\r\nenterprise environments enabling more flexible AI orchestra",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Agent Loop in Azure Logic Apps [Consumption]",
      "link": "https://azure.microsoft.com/updates?id=527658",
      "description": "Announcing the public preview of Agent Loop\r\nin Azure Logic Apps (Consumption) — bringing agentic intelligence and adaptive\r\nworkflows to the serverless Logic Apps runtime. Agent Loop enables you to move beyond traditional, static\r\nautomation by creating goa",
      "japaneseTitle": "[In preview] Public Preview: Agent Loop in Azure Logic Apps [Consumption]",
      "japaneseDescription": "Announcing the public preview of Agent Loop\r\nin Azure Logic Apps (Consumption) — bringing agentic intelligence and adaptive\r\nworkflows to the serverless Logic Apps runtime. Agent Loop enables you to move beyond traditional, static\r\nautomation by creating goa",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Agent Loop in Azure Logic Apps [Standard]",
      "link": "https://azure.microsoft.com/updates?id=527649",
      "description": "Announcing the general availability of Agent\r\nLoop in Azure Logic Apps (Standard), a breakthrough capability that redefines\r\nhow organizations design and automate business processes. Agent Loop enables you to move beyond traditional workflow\r\nautomation by b",
      "japaneseTitle": "[Launched] Generally Available: Agent Loop in Azure Logic Apps [Standard]",
      "japaneseDescription": "Announcing the general availability of Agent\r\nLoop in Azure Logic Apps (Standard), a breakthrough capability that redefines\r\nhow organizations design and automate business processes. Agent Loop enables you to move beyond traditional workflow\r\nautomation by b",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Automated Testing Framework for Logic Apps [Standard]",
      "link": "https://azure.microsoft.com/updates?id=527644",
      "description": "We’re pleased to\r\nannounce the general availability of automated testing for Azure Logic Apps\r\n(Standard) in the Visual Studio Code extension. This new capability empowers\r\ndevelopers and integration specialists to build more reliable workflows by\r\nsimplifyin",
      "japaneseTitle": "[Launched] Generally Available: Automated Testing Framework for Logic Apps [Standard]",
      "japaneseDescription": "We’re pleased to\r\nannounce the general availability of automated testing for Azure Logic Apps\r\n(Standard) in the Visual Studio Code extension. This new capability empowers\r\ndevelopers and integration specialists to build more reliable workflows by\r\nsimplifyin",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Govern Model Context Protocol (MCP) endpoints using Azure API Management",
      "link": "https://azure.microsoft.com/updates?id=527626",
      "description": "Model Context Protocol (MCP) governance in\r\nAzure API Management (APIM) is now generally available.This release extends Azure API Management’s proven\r\ngovernance, security, and observability model to a new generation of AI-driven\r\nworkloads. Enterprises can",
      "japaneseTitle": "[Launched] Generally Available: Govern Model Context Protocol (MCP) endpoints using Azure API Management",
      "japaneseDescription": "Model Context Protocol (MCP) governance in\r\nAzure API Management (APIM) is now generally available.This release extends Azure API Management’s proven\r\ngovernance, security, and observability model to a new generation of AI-driven\r\nworkloads. Enterprises can",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Announcing: API Center Standard now included at no additional cost for linked Azure API Management Standard and Premium tiers",
      "link": "https://azure.microsoft.com/updates?id=527621",
      "description": "API Center Standard,\r\npreviously a separate paid offering, is now included at no additional cost for\r\nall Azure API Management Standard and Premium customers, when an API Center\r\ninstance is linked with a corresponding Azure API Management service (for both",
      "japaneseTitle": "[Launched] Announcing: API Center Standard now included at no additional cost for linked Azure API Management Standard and Premium tiers",
      "japaneseDescription": "API Center Standard,\r\npreviously a separate paid offering, is now included at no additional cost for\r\nall Azure API Management Standard and Premium customers, when an API Center\r\ninstance is linked with a corresponding Azure API Management service (for both",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Premium v2 tier in Azure API Management",
      "link": "https://azure.microsoft.com/updates?id=527612",
      "description": "Announcing the general availability of the Azure API Management Premium v2 tier,\r\nour most powerful and scalable option for managing APIs at enterprise scale. Premium v2\r\ndelivers superior performance, the highest entity limits, unlimited included\r\nAPI calls",
      "japaneseTitle": "[Launched] Generally Available: Premium v2 tier in Azure API Management",
      "japaneseDescription": "Announcing the general availability of the Azure API Management Premium v2 tier,\r\nour most powerful and scalable option for managing APIs at enterprise scale. Premium v2\r\ndelivers superior performance, the highest entity limits, unlimited included\r\nAPI calls",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: OpenShift Virtualization now available on Azure Red Hat OpenShift",
      "link": "https://azure.microsoft.com/updates?id=527236",
      "description": "Red Hat OpenShift Virtualization is now generally available on Azure Red Hat OpenShift (ARO), enabling customers to manage virtual machines and containers from one cloud-native platform. This GA builds on feedback from the preview announced at Red Hat Sum",
      "japaneseTitle": "[Launched] Generally Available: OpenShift Virtualization now available on Azure Red Hat OpenShift",
      "japaneseDescription": "Red Hat OpenShift Virtualization is now generally available on Azure Red Hat OpenShift (ARO), enabling customers to manage virtual machines and containers from one cloud-native platform. This GA builds on feedback from the preview announced at Red Hat Sum",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft Foundry Fine-Tuning Updates",
      "link": "https://azure.microsoft.com/updates?id=526742",
      "description": "Microsoft\r\nFoundry Fine-Tuning is updated to reflect a complete redesign of Foundry’s UI,\r\ndelivering an agent-first experience for developers and data scientists. The\r\nnew interface streamlines model creation, evaluation, and deployment,\r\nintegrates with VS",
      "japaneseTitle": "[In preview] Public Preview: Microsoft Foundry Fine-Tuning Updates",
      "japaneseDescription": "Microsoft\r\nFoundry Fine-Tuning is updated to reflect a complete redesign of Foundry’s UI,\r\ndelivering an agent-first experience for developers and data scientists. The\r\nnew interface streamlines model creation, evaluation, and deployment,\r\nintegrates with VS",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft Foundry Control Plane & Entra Agent ID",
      "link": "https://azure.microsoft.com/updates?id=526665",
      "description": "Microsoft Foundry introduces a unified platform\r\nfor enterprise AI agent observability, security, and governance. The Control\r\nPlane integrates identity, monitoring, and compliance, providing centralized\r\ncontrol, deep observability, and compliance for agent",
      "japaneseTitle": "プレビュー: Microsoft Foundry Control Plane & Entra Agent ID",
      "japaneseDescription": "Microsoft Foundryは、エンタープライズAIエージェントの観察可能性、セキュリティ、ガバナンスのための統一されたプラットフォームを導入します。Control Planeは、アイデンティティ、監視、コンプライアンスを統合し、集中管理、深い観察可能性、コンプライアンスをエージェントに提供します。",
      "technicalTags": [
        "Microsoft Foundry",
        "Entra Agent ID"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: GitHub Copilot app modernization expanded capabilities",
      "link": "https://azure.microsoft.com/updates?id=526618",
      "description": "Announcing new enhancements to GitHub Copilot App\r\nModernization that are Generally Available, making it easier than ever to modernize applications, databases,\r\ncontainers, and accelerate migration to Azure. Below capabilities are\r\nnow Generally Available: F",
      "japaneseTitle": "[Launched] Generally Available: GitHub Copilot app modernization expanded capabilities",
      "japaneseDescription": "Announcing new enhancements to GitHub Copilot App\r\nModernization that are Generally Available, making it easier than ever to modernize applications, databases,\r\ncontainers, and accelerate migration to Azure. Below capabilities are\r\nnow Generally Available: F",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Model Router in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=526330",
      "description": "Model router in Microsoft Foundry is now generally\r\navailable. Model router is an AI orchestration layer dynamically selects the\r\noptimal model for each prompt. It now supports a broader range of models\r\nincluding: GPT-4 family, GPT-5 family, GPT-oss, Deepse",
      "japaneseTitle": "[Launched] Generally Available: Model Router in Microsoft Foundry",
      "japaneseDescription": "Model router in Microsoft Foundry is now generally\r\navailable. Model router is an AI orchestration layer dynamically selects the\r\noptimal model for each prompt. It now supports a broader range of models\r\nincluding: GPT-4 family, GPT-5 family, GPT-oss, Deepse",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In development] Private Preview: Foundry Local Android support",
      "link": "https://azure.microsoft.com/updates?id=526198",
      "description": "Foundry Local now extends its capabilities to\r\nAndroid, in addition to Windows and Mac supporting\r\nadvanced on-device AI for smartphones, tablets, and IoT devices, while Whisper model integration delivers\r\nrobust, privacy-preserving speech and audio processi",
      "japaneseTitle": "[In development] Private Preview: Foundry Local Android support",
      "japaneseDescription": "Foundry Local now extends its capabilities to\r\nAndroid, in addition to Windows and Mac supporting\r\nadvanced on-device AI for smartphones, tablets, and IoT devices, while Whisper model integration delivers\r\nrobust, privacy-preserving speech and audio processi",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Foundry Local updates",
      "link": "https://azure.microsoft.com/updates?id=526193",
      "description": "Foundry Local now extends its capabilities, supporting the Whisper model and advanced on-device AI for\r\nsmartphones, tablets, and IoT devices. Whisper model integration delivers robust, privacy-preserving\r\nspeech and audio processing. The redesigned Foundry",
      "japaneseTitle": "[In preview] Public Preview: Foundry Local updates",
      "japaneseDescription": "Foundry Local now extends its capabilities, supporting the Whisper model and advanced on-device AI for\r\nsmartphones, tablets, and IoT devices. Whisper model integration delivers robust, privacy-preserving\r\nspeech and audio processing. The redesigned Foundry",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Foundry IQ by Azure AI Search",
      "link": "https://azure.microsoft.com/updates?id=526150",
      "description": "Foundry\r\nIQ, powered by Azure AI Search, is a knowledge system that delivers a smarter way to ground agents in enterprise\r\ndata. Agents only need to connect to a single knowledge base to access\r\nmultiple sources, removing the need to manage separate APIs and",
      "japaneseTitle": "[In preview] Public Preview: Foundry IQ by Azure AI Search",
      "japaneseDescription": "Foundry\r\nIQ, powered by Azure AI Search, is a knowledge system that delivers a smarter way to ground agents in enterprise\r\ndata. Agents only need to connect to a single knowledge base to access\r\nmultiple sources, removing the need to manage separate APIs and",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Foundry Tools (rebrand from Azure AI Services)",
      "link": "https://azure.microsoft.com/updates?id=526132",
      "description": "Foundry Tools (rebranded from Azure AI Services)\r\nprovide a unified suite of prebuilt, production-ready AI capabilities for\r\naudio, video, images, documents, and text. Seamlessly integrated into the Microsoft\r\nFoundry platform, these tools empower developers",
      "japaneseTitle": "[Launched] Generally Available: Foundry Tools (rebrand from Azure AI Services)",
      "japaneseDescription": "Foundry Tools (rebranded from Azure AI Services)\r\nprovide a unified suite of prebuilt, production-ready AI capabilities for\r\naudio, video, images, documents, and text. Seamlessly integrated into the Microsoft\r\nFoundry platform, these tools empower developers",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Content Understanding in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=526123",
      "description": "With the general availability of Content Understanding, the service now enables connecting to Foundry models, allowing customers to use Foundry model deployments. Additional key updates include support for VNETs, Managed Identities, Customer Managed Keys",
      "japaneseTitle": "[Launched] Generally Available: Content Understanding in Microsoft Foundry",
      "japaneseDescription": "With the general availability of Content Understanding, the service now enables connecting to Foundry models, allowing customers to use Foundry model deployments. Additional key updates include support for VNETs, Managed Identities, Customer Managed Keys",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Enrich agents with a unified catalog of prebuilt and custom tools in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=526114",
      "description": "With these latest updates in public preview, Microsoft Foundry enables developers to enrich agents with real-time business context, multimodal capabilities, and custom business logic through a unified catalog of Model Context Protocol (MCP) tools.​Unified",
      "japaneseTitle": "[In preview] Public Preview: Enrich agents with a unified catalog of prebuilt and custom tools in Microsoft Foundry",
      "japaneseDescription": "With these latest updates in public preview, Microsoft Foundry enables developers to enrich agents with real-time business context, multimodal capabilities, and custom business logic through a unified catalog of Model Context Protocol (MCP) tools.​Unified",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Built-in memory in Foundry Agent Service",
      "link": "https://azure.microsoft.com/updates?id=526004",
      "description": "The new long-term memory in Foundry Agent Service gives developers a robust, scalable foundation for agents that can remember, adapt, and act coherently across sessions and workflows. Integrated directly into the Foundry runtime, memory provides a persist",
      "japaneseTitle": "[In preview] Public Preview: Built-in memory in Foundry Agent Service",
      "japaneseDescription": "The new long-term memory in Foundry Agent Service gives developers a robust, scalable foundation for agents that can remember, adapt, and act coherently across sessions and workflows. Integrated directly into the Foundry runtime, memory provides a persist",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Multi-agent workflows in Foundry Agent Service",
      "link": "https://azure.microsoft.com/updates?id=525999",
      "description": "Developers can now\r\nbuild robust multi-agent workflows using both a visual designer and code-first\r\nAPI. These workflows provide structured orchestration, context sharing,\r\npersistent state, and error recovery for complex enterprise processes. The\r\nmodular de",
      "japaneseTitle": "[In preview] Public Preview: Multi-agent workflows in Foundry Agent Service",
      "japaneseDescription": "Developers can now\r\nbuild robust multi-agent workflows using both a visual designer and code-first\r\nAPI. These workflows provide structured orchestration, context sharing,\r\npersistent state, and error recovery for complex enterprise processes. The\r\nmodular de",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Hosted agents in Foundry Agent Service",
      "link": "https://azure.microsoft.com/updates?id=525994",
      "description": "Hosted agents in Foundry Agent Service make it effortless for teams to move\r\nfrom local experimentation to full-scale production.Developers can now deploy custom-code agents\r\nbuilt with Microsoft Agent Framework, LangGraph, CrewAI,\r\nor other open-source fram",
      "japaneseTitle": "[In preview] Public Preview: Hosted agents in Foundry Agent Service",
      "japaneseDescription": "Hosted agents in Foundry Agent Service make it effortless for teams to move\r\nfrom local experimentation to full-scale production.Developers can now deploy custom-code agents\r\nbuilt with Microsoft Agent Framework, LangGraph, CrewAI,\r\nor other open-source fram",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Observability in Foundry Control Plane",
      "link": "https://azure.microsoft.com/updates?id=525985",
      "description": "Observability in Foundry Control Plane now in public preview for agents with a GA pre-announcement for model evals is a comprehensive suite of capabilities that enable developers to evaluate, monitor, and optimize the quality, performance, and safety of m",
      "japaneseTitle": "[Launched] Generally Available: Observability in Foundry Control Plane",
      "japaneseDescription": "Observability in Foundry Control Plane now in public preview for agents with a GA pre-announcement for model evals is a comprehensive suite of capabilities that enable developers to evaluate, monitor, and optimize the quality, performance, and safety of m",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Enterprise MCP enhancements in Foundry Agent Service",
      "link": "https://azure.microsoft.com/updates?id=525976",
      "description": "Microsoft Foundry has enhanced integration to Enterprise MCP to enable secure, authenticated connections to MCP servers, allowing credentials to be passed to MCP servers securely. These updates enable enhanced flexibility, security, and compliance when in",
      "japaneseTitle": "[In preview] Public Preview: Enterprise MCP enhancements in Foundry Agent Service",
      "japaneseDescription": "Microsoft Foundry has enhanced integration to Enterprise MCP to enable secure, authenticated connections to MCP servers, allowing credentials to be passed to MCP servers securely. These updates enable enhanced flexibility, security, and compliance when in",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: Microsoft Foundry one-click deploy channels in Teams, M365 and non-Microsoft",
      "link": "https://azure.microsoft.com/updates?id=525971",
      "description": "Microsoft Foundry now\r\nenables one-click, no-code publishing of custom agents to Microsoft Teams and\r\nMicrosoft 365 Copilot. This feature removes the complexity of pro-code\r\ndeployment, allowing organizations to instantly reach millions of users while\r\nmainta",
      "japaneseTitle": "[In preview] Public Preview: Microsoft Foundry one-click deploy channels in Teams, M365 and non-Microsoft",
      "japaneseDescription": "Microsoft Foundry now\r\nenables one-click, no-code publishing of custom agents to Microsoft Teams and\r\nMicrosoft 365 Copilot. This feature removes the complexity of pro-code\r\ndeployment, allowing organizations to instantly reach millions of users while\r\nmainta",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[In preview] Public Preview: LLM Speech in Microsoft Foundry",
      "link": "https://azure.microsoft.com/updates?id=525962",
      "description": "LLM Speech in\r\nMicrosoft Foundry brings advanced large language model capabilities to speech,\r\ndelivering transcription and translation with unmatched fluency and contextual\r\nawareness. With enhanced\r\nmultilingual support and advanced prompt tuning, this API",
      "japaneseTitle": "[In preview] Public Preview: LLM Speech in Microsoft Foundry",
      "japaneseDescription": "LLM Speech in\r\nMicrosoft Foundry brings advanced large language model capabilities to speech,\r\ndelivering transcription and translation with unmatched fluency and contextual\r\nawareness. With enhanced\r\nmultilingual support and advanced prompt tuning, this API",
      "technicalTags": [
        "Azure"
      ],
      "extractedLinks": [],
      "date": "2025-11-18T16:00:16.000Z"
    },
    {
      "title": "[Launched] Generally Available: Model Context Protocol support in Azure API Management and Azure API Center",
      "link": "https://azure.microsoft.com/updates?id=491990",
      "description": "Announcing\r\nthe public preview of Model Context Protocol (MCP) support in Azure API\r\nManagement and Azure API Center. With this new capability, enterprises can\r\ntransform their existing APIs into dynamic, agent-ready tools, while improving\r\nsecurity and simpl",
      "japaneseTitle": "一般提供開始: Azure API ManagementおよびAzure API CenterでのModel Context Protocolのサポート",
      "japaneseDescription": "Azure API ManagementおよびAzure API CenterでのModel Context Protocol (MCP) のサポートが一般提供開始されました。この新しい機能により、企業は既存のAPIをダイナミックでエージェント対応のツールに変換し、セキュリティとシンプルさを向上させることができます。",
      "technicalTags": [
        "Azure API Management",
        "Azure API Center",
        "Model Context Protocol"
      ],
      "extractedLinks": [],
      "date": "2025-05-23T15:00:30.000Z"
    }
  ]
}